--The file is automatically generated, please do not modify it manually. From the data file:FlySword_Grave
local L_CompressMaxColumn = 3
local L_CompressData = {
460361408552218113,1717992151556905,824692447398001,
--1,Song Rìu Sơn Tinh,1,1,2115,蕴含无穷潜力的大道之剑，寄托了玄天宗数百年来打破【天之禁】桎梏的夙愿。远在玄天宗建立以前，便已流传此界。,9001,1_25,400001,6310001,3500,6000,,
460502150603975938,1717995821998889,824692447398002,
--2,Song Rìu Sơn Tinh - 2,1,2,2116,剑身铭文记载此剑由众神采首山之铜为黄帝所铸，【轩辕】便是帝之尊名。然岁月流转，万物枯荣，再也无人知晓，众神何在，黄帝何在？,9001,1_30,400002,6310002,3500,6000,,
460642896950701187,1718001791247145,1374389541030003,
--3,Song Rìu Sơn Tinh - 3,1,3,2118,六位剑灵之中，轩辕剑灵无疑是最为独特的存在。她拥有自己的意志，却不知自己为何而生，又将去往何处。,9001,1_35,400003,6310003,0,10000,,
460783630412524420,1718004408918825,687194773670004,
--4,Song Rìu Sơn Tinh - 4,1,4,2117,她的面容威严而平静，眼眸中却又倒映着无尽时光流逝带来的沧桑。当你们心神相系的那一刻，她的眼中似乎有一闪而逝的期待，是错觉吗？,9001,1_40,400004,6310004,0,5000,,
460924376759249413,1718008705033001,1374389541030005,
--5,Song Rìu Sơn Tinh - 5,1,5,2119,与她的心神联系日益紧密，只需心念一动，她便能操纵轩辕剑为你御敌。力量觉醒之后，她的身姿也产生了变化，威严更胜往昔，眉眼中又多了几分灵动。,9001,1_45,400005,6310005,0,10000,,
461065118811007110,1718013075661609,755914250406006,
--6,Song Rìu Sơn Tinh - 6,1,6,2120,也许这一次，她不需要再眼睁睁看着你如同凡人般消逝而无能为力。也许这一次，即使是天道法则你们也能争上一争！,9001,1_50,400006,6310006,0,5500,,
461165886010914567,1718017500259116,824692447398007,
--7,Liên Châu Nỏ,2,1,1006,以赤水北漠的圣石【东皇劫石】所铸之剑。900年前，万妖肆虐，火尊教激发圣石灵力，一击便焚尽入侵赤水北漠的妖族。,9004,1_225,400007,6310007,3500,6000,,
461306623767705096,1718021969519404,824692447398008,
--8,Liên Châu Nỏ - 2,2,2,1006,600年前宝树妖王寄身双生圣女之一古利夏提，并操纵火尊教对抗玄天宗。另一位圣女阿伊慕识破妖王真身。以自身献给圣石之火，化为东皇剑，诛灭了妖王。自那以后，玄天宗便取走东皇剑，收归剑冢。,9004,1_235,400008,6310008,3500,6000,,
461447361524495625,1718025892799277,1374389541030009,
--9,Liên Châu Nỏ - 3,2,3,1006,所有的剑灵都失去了生前的记忆，只要认主，便会依令行事，没有顾虑，亦不会思索。只是，作为东皇剑灵的她对妖族似乎格外痛恨，若剑主不加以制止，便定会将敌方焚为飞灰，方肯作罢。,9005,1_250,400009,6310009,0,10000,,
461588099281286282,1718030559486765,687194773670010,
--10,Liên Châu Nỏ - 4,2,4,1006,或许，即使转生为剑灵，她也忘不掉使自己投身烈火的妖魔。而东皇剑主多为少女，或许她也忘不掉自己的妹妹。,9005,1_265,400010,6310010,0,5000,,
461728837038076683,1718034854486830,1374389541030011,
--11,Liên Châu Nỏ - 5,2,5,1006,人世间又走了一遭，重生的东皇剑灵并未忘却与你在赤水北漠的遭遇，反而觉醒了更强大的力量，真是前所未见。,9006,1_280,400011,6310011,0,10000,,
461869574794867212,1718039149486894,755914250406012,
--12,Liên Châu Nỏ - 6,2,6,1006,令人苦恼的是，在命东皇剑出击时，你若昏招频出，便立马会遭到她的训斥，简直如同长姐一般。对于了却尘缘的修仙者来说，这真是一种别样的体验。,9006,3_3000000,400012,6310012,0,5500,,
462010315252789517,1718043444519727,824692447398013,
--13,Phù Đổng Thần Binh,3,1,1007,龙渊为凶剑，现世百年，两位剑主皆以剑自戕而亡，时任掌门只得下令封剑。,9007,3_8100000,400013,6310013,3500,6000,,
462151053009580046,1718047739519791,824692447398014,
--14,Phù Đổng Thần Binh - 2,3,2,1007,剑身状若龙牙，以【万年玄冰】铸就，若长久注视，神识会被幻光牵引，仿佛堕入深渊般难以挣脱，因而剑名龙渊。于500年前自从极之渊中破封而出，被时任看守长老镇压，收归剑冢。,9007,3_12500000,400014,6310014,3500,6000,,
462291790766370703,1718052034519856,1374389541030015,
--15,Phù Đổng Thần Binh - 3,3,3,1007,喜、怒、哀、惧、爱、恶、欲，生灵皆有七情，人如是，妖亦如是。“不染七情，方能不为其所害，你们既要沉沦，我便推你们一把。”,9008,3_16000000,400015,6310015,0,10000,,
462432528523161232,1718056329519920,687194773670016,
--16,Phù Đổng Thần Binh - 4,3,4,1007,她不染七情，却专攻七情。剑光迷离，映照诸般心魔。剑意缠绵，一刹永堕沉沦。,9008,3_20500000,400016,6310016,0,5000,,
462573266279951889,1718060624519985,1374389541030017,
--17,Phù Đổng Thần Binh - 5,3,5,1007,前世她本应偏安一隅，却遭妖王冰夷欺骗，为他铸造剑灵。只是造化弄人，剑成之际，她才惊觉这不过是一场幻梦，愤而以身祭剑，化为绝情之灵。,9009,3_28100000,400017,6310017,0,10000,,
462714004036742418,1718064919520049,755914250406018,
--18,Phù Đổng Thần Binh - 6,3,6,1007,今世她再投妖身，负心者亦假戏成真，两心相知，转而又天人永隔。“七情六欲，果真最为伤人。”,9009,3_33600000,400018,6310018,0,5500,,
462854744496304019,1718069214552882,824692447398019,
--19,Rìu Thạch Sanh,4,1,1008,天生之剑。本为天虞之山中，【万木之精】化形的瑶草。汇聚千百年来山民信念，得以诞生一丝神识，可以回应祈求。,9010,3_39600000,400019,6310019,3500,6000,,
462995482253094420,1718073509552946,824692447398020,
--20,Rìu Thạch Sanh - 2,4,2,1008,900年前的万妖之劫中，因山民寻求庇佑的强烈请愿，化为神剑，力斩群妖。百年前被时任剑主姬明真带回玄天宗，于剑寂之劫后存于剑冢之中。,9010,3_43900000,400020,6310020,3500,6000,,
463136220009784341,1718077804553011,1374389541030021,
--21,Rìu Thạch Sanh - 3,4,3,1008,在遇到姬明真前，她的眼中只有山中天地，回应山民的祈愿便是全部。直到与他心神相系，她才看清真正广阔的天与地，还有横亘其上的——天之禁。,9011,3_52000000,400021,6310021,0,10000,,
463276957766573974,1718082099553075,687194773670022,
--22,Rìu Thạch Sanh - 4,4,4,1008,天之禁如同一道禁锢众生的枷锁，一旦超越，便会被天道之威碾碎。只是已经无法回头了，他的执念深深刻在了她的心中，成为了她唯一的使命。,9011,3_60300000,400022,6310022,0,5000,,
463417695523364503,1718086394553140,1374389541030023,
--23,Rìu Thạch Sanh - 5,4,5,1008,再也回不去了，她的心已经被打开，如同茁壮成长的大树一般，想要顶破一切桎梏。山民的生命是如此短暂，许多人她只见过一面，再见时已是白发苍苍。,9012,3_68900000,400023,6310023,0,10000,,
463558433278621592,1718090689553204,755914250406024,
--24,Rìu Thạch Sanh - 6,4,6,1008,天之禁下的修仙者们，纵是向往拿神鬼莫测的境界，却也贪生怕死，不敢越雷池一步。这次，她一定要去往天之禁外那个宽广的，没有限制的诸界。这次，她不想再被人抛下。,9012,3_77600000,400024,6310024,0,5500,,
463699173736540057,1718094984586037,824692447398025,
--25,Thủy Tinh Ba Chĩa,5,1,1009,人所铸造的第一把剑灵之剑，以玄剑峰剑冢的【太阿金气】凝聚而成。甫一出世，重创万妖之主，扭转了人妖之战的局势。,9013,3_86600000,400025,6310025,3500,6000,,
463839911493330458,1718099279586101,824692447398026,
--26,Thủy Tinh Ba Chĩa - 2,5,2,1009,太阿之威过于凶厉，令首任剑主——姬临渊敌我不分，许多人族殒命在剑威之下，这压垮了他的心智。凭着最后一丝清明，他抛出了太阿，或许是不忍此剑再添恶业。,9013,3_95900000,400026,6310026,3500,6000,,
463980649250121115,1718103574586166,1374389541030027,
--27,Thủy Tinh Ba Chĩa - 3,5,3,1009,太阿剑再次唤醒剑灵之时，人们惊奇地发现她的面容竟与昔日玄剑宗的宗主之女——姬招离别无二致。一时之间，关于为何姬临渊会让独女成为剑灵的因由众说纷纭。,9014,3_105300000,400027,6310027,0,10000,,
464121387006911644,1718107869586230,687194773670028,
--28,Thủy Tinh Ba Chĩa - 4,5,4,1009,人们对于少女为何成为剑灵的因由生了诸多疑问，其中不乏恶意揣测。少女剑灵漠视着这一切，仿佛尘世之事与己无关。,9014,3_115000000,400028,6310028,0,5000,,
464262124763702173,1718112164586295,1374389541030029,
--29,Thủy Tinh Ba Chĩa - 5,5,5,1009,少女因一时的意气化为剑灵，手刃了罪魁祸首，却也遗忘了自己想保护的一切。未曾想到抛下的过往会以另一种方式回归，看似无解的宿命也会有意想不到的转机,9015,3_124900000,400029,6310029,0,10000,,
464402862520492702,1718116459586359,755914250406030,
--30,Thủy Tinh Ba Chĩa - 6,5,6,1009,曾经，她无法选择，只能为剑主的使命而活。如今，她选择与你并肩，无论何种阻碍，她都会为你将其粉碎。,9015,3_135000000,400030,6310030,0,5500,,
464543602978415135,1718120754619192,824692447398031,
--31,Thuận Thiên Kiếm,6,1,1010,剑威至猛，居诸剑之首，一击便可穿云裂石，需要极其强大的意念方可驱使。后世记载中，巨阙的铸剑师为巨阙首任剑主。,9016,3_145400000,400031,6310031,3500,6000,,
464684340735205664,1718125049619256,824692447398032,
--32,Thuận Thiên Kiếm - 2,6,2,1010,相传巨阙的铸剑师终其一生只为铸一剑，其志之坚令不周天墟的【巨阙封石】有感通灵。巨阙既成，铸剑师将剑交予玄天宗后便力竭而亡，连名字也未曾留下。,9016,3_156000000,400032,6310032,3500,6000,,
464825078491996193,1718129344619321,1374389541030033,
--33,Thuận Thiên Kiếm - 3,6,3,1010,铸剑即是铸心，铸剑者所持心念，本身便会成为剑意，通灵名剑更是如此。如同那位无名的铸剑师一样，她择主别无他求，只要心性至坚定至纯。,9017,3_184300000,400033,6310033,0,10000,,
464965816248786722,1718133639619385,687194773670034,
--34,Thuận Thiên Kiếm - 4,6,4,1010,能成为巨阙剑主之人却是少之又少，人们都说是因为巨阙的铸造之法有缺陷。对此，巨阙剑灵直做过一次回答。“人心裹挟之物太多，我嫌他们吵闹。”,9017,3_222200000,400034,6310034,0,5000,,
465106554005577251,1718137934619450,1374389541030035,
--35,Thuận Thiên Kiếm - 5,6,5,1010,那位万年前的神灵，赋予她形体，却未告知她诞生的因由。那位无名铸剑师，赋予她灵智，却来不及告诉她该去往何方。,9018,3_252100000,400035,6310035,0,10000,,
465247291762367780,1718142229619514,755914250406036,
--36,Thuận Thiên Kiếm - 6,6,6,1010,若亘古不变的石头存在意志，必然会质疑自己存在的意义？而你，连接她的过往与当下之人，是否能给她一个答案？,9018,3_273400000,400036,6310036,0,5500,,
}
local L_MainKeyDic = {
[1]=1,[2]=2,[3]=3,[4]=4,[5]=5,[6]=6,[7]=7,[8]=8,[9]=9,[10]=10,[11]=11,[12]=12,[13]=13,[14]=14,[15]=15,
[16]=16,[17]=17,[18]=18,[19]=19,[20]=20,[21]=21,[22]=22,[23]=23,[24]=24,[25]=25,[26]=26,[27]=27,[28]=28,[29]=29,[30]=30,
[31]=31,[32]=32,[33]=33,[34]=34,[35]=35,[36]=36,}
local L_NamesByNum = {
   Id = 1,
   FlysorwdNum = 3,
   Type = 4,
   Icon = 5,
   Skill = 7,
   CloneId = 9,
   FlySwordId = 10,
   BlackTime = 11,
   JiesuanTime = 12,
}
local L_NamesByString = {
   Name = 2,
   Describe = 6,
   Condition = 8,
}
local L_ColNameIndexs = {
   Id = 0,
   Name = 1,
   FlysorwdNum = 2,
   Type = 3,
   Icon = 4,
   Describe = 5,
   Skill = 6,
   Condition = 7,
   CloneId = 8,
   FlySwordId = 9,
   BlackTime = 10,
   JiesuanTime = 11,
}
--local L_ColumnUseBitCount = {7,17,4,4,13,15,15,17,20,24,13,15,}
--local L_ColumnList = {1,1,1,1,1,1,2,2,2,3,3,3,}
--local L_ShiftDataList = {0,7,24,28,32,45,0,15,32,0,24,37,}
--local L_AndDataList = {63,65535,7,7,4095,16383,16383,65535,524287,8388607,4095,16383,}
local L_ColumnShiftAndList = {1,0,63,1,7,65535,1,24,7,1,28,7,1,32,4095,1,45,16383,2,0,16383,2,15,65535,2,32,524287,3,0,8388607,3,24,4095,3,37,16383,}
local L_ColNum = 12;
local L_UseDataK = setmetatable({ },{ __mode = 'k'});
local L_UseDataV = setmetatable({ },{ __mode = 'v'});
local L_UseDataRow = setmetatable({ },{ __mode = 'v'});
local L_IsCache = false;
local mt = {}
local function GetData(row, column)
    local startIndex = (column - 1) * 3
    local _compressData = L_CompressData[(row - 1)*L_CompressMaxColumn+L_ColumnShiftAndList[startIndex + 1]]
    local _tempData = _compressData >> L_ColumnShiftAndList[startIndex + 2]
    local _data = _tempData & L_ColumnShiftAndList[startIndex + 3]
    local _andSign = L_ColumnShiftAndList[startIndex + 3] + 1
    local _isMinus = (_andSign & _tempData) == _andSign
    return _isMinus and -_data or _data;
end

mt.__index = function (t,key)
    local _key = L_UseDataK[t];
    local _row = L_MainKeyDic[_key];
    local _column = L_NamesByNum[key];
    if _column ~= nil then
        if L_IsCache then
            local _data = L_UseDataRow[_row * L_ColNum + _column]
            if not _data then
                _data = GetData(_row, _column)
                L_UseDataRow[_row * L_ColNum + _column] = _data
            end
            return _data
        else
            return GetData(_row, _column)
        end
    end
    _column = L_NamesByString[key]
    if _column ~= nil then
        return StringDefines[GetData(_row, _column)]
    end
    if string.find(key, '_') then
        local _newKey = string.gsub(key, '_', '')
        _column = L_NamesByString[_newKey]
        if _column ~= nil then
           return GetData(_row, _column)
        end
    end
    if key ~= '_OnCopyAfter_' then
        return
    end
end

local M = {
    _CompressData_ = L_CompressData,
    _ColumnShiftAndList_ = L_ColumnShiftAndList,
    _CompressMaxColumn_ = L_CompressMaxColumn,
    _ColumnNameIndexs_ = L_ColNameIndexs,
    Count = 36
}

function M:Foreach(func)
    for i=1,M.Count do
        local _key = GetData(i, 1)
        func(_key, M[_key])
    end
end

function M:ForeachCanBreak(func)
    for i = 1,M.Count do
        local _key = GetData(i, 1)
        if func(_key, M[_key]) then
            break
        end
    end
end

function M:GetByIndex(index)
    return M[GetData(index, 1)];
end

function M:IsContainKey(key)
    return not(not L_MainKeyDic[key]);
end

function M:SetIsCache(isCh)
    L_IsCache = isCh;
end

setmetatable(M, {__index = function(t, key)
    if not L_MainKeyDic[key] then
        return;
    end
    local _t = L_UseDataV[key];
    if not _t then
        _t = setmetatable({}, mt);
        L_UseDataV[key] = _t;
        L_UseDataK[_t] = key;
    end
    return _t
end})

return M
