--The file is automatically generated, please do not modify it manually. From the data file:attributeAdd
local L_CompressMaxColumn = 1
local L_CompressData = {
19188902733217793,
--1,78000,Vật công,0,1,2,,
10245519940796418,
--2,2500,HP,0,1,1,,
217325285367545859,
--3,78000,Phá giáp,0,1,24,,
37203299185328132,
--4,100000,Vật phòng,0,1,4,,
55195694659272709,
--5,120000,Chính xác,0,1,6,,
64202891766530054,
--6,120000,Né tránh,0,1,7,,
26594539896839,
--7,25000,Tốc độ đánh,0,0,,,
226354480977805320,
--8,0,Tốc độ chạy,0,1,25,,
32109339344905,
--9,40000,幸运,0,0,,,
32111732588554,
--10,100000,仙术攻击,0,0,,,
72106192207282187,
--11,150000,Bạo kích,0,0,8,,
32116232355852,
--12,150000,韧性,0,0,,,
310404138532877,
--13,100000,增伤,1,0,,,
313593151750158,
--14,100000,减伤,1,0,,,
313595299233807,
--15,100000,破击率,1,0,,,
313597446717456,
--16,100000,御破率,1,0,,,
313599594201105,
--17,100000,精准率,1,0,,,
313601741684754,
--18,100000,偏斜率,1,0,,,
82520763993292819,
--19,100000,Tỷ lệ bạo,1,1,9,,
91527961100550164,
--20,100000,Kháng bạo,1,1,10,,
110651799054712853,
--21,100000,控制延长,1,2,12,,
119659000456937494,
--22,100000,控制缩短,1,2,13,,
313612069502999,
--23,0,会心几率,1,0,,,
313614216986648,
--24,0,会心抵抗,1,0,,,
313616774070297,
--25,100000,连击几率,1,0,,,
313618921553946,
--26,100000,格挡几率,1,0,,,
313621069037595,
--27,100000,追击几率,1,0,,,
313623216521244,
--28,100000,识破几率,1,0,,,
313624954404893,
--29,0,攻击加强,1,0,,,
313627101888542,
--30,0,生命增幅,1,0,,,
313629249372191,
--31,0,破甲强化,1,0,,,
313631396855840,
--32,0,防御加固,1,0,,,
313633544339489,
--33,0,攻速加成提升比,1,0,,,
313635691823138,
--34,0,移速加成提升比,1,0,,,
313637839306787,
--35,0,PVE增伤,1,0,,,
313639986790436,
--36,0,PVE减伤,1,0,,,
313642134274085,
--37,0,PVP增伤,1,0,,,
313644281757734,
--38,0,PVP减伤,1,0,,,
313646429241383,
--39,0,角色生命,1,0,,,
313648576725032,
--40,0,角色攻击,1,0,,,
313650724208681,
--41,0,角色防御,1,0,,,
313652871692330,
--42,0,角色破甲,1,0,,,
313655019175979,
--43,0,天元（经验效率）,1,0,,,
313657166659628,
--44,0,战前回血,1,0,,,
128401180492562477,
--45,0,Kim Công,0,2,14,,
137408377599819822,
--46,0,Mộc Công,0,2,15,,
146415574707077167,
--47,0,Thủy Công,0,2,16,,
155422771814334512,
--48,0,Hỏa Công,0,2,17,,
164429968921591857,
--49,0,Thổ Công,0,2,18,,
173702256114925618,
--50,100000,风元素抗性,1,2,19,,
182709457517150259,
--51,100000,火元素抗性,1,2,20,,
191716658919374900,
--52,100000,水元素抗性,1,2,21,,
200723860321599541,
--53,100000,雷元素抗性,1,2,22,,
209731061723824182,
--54,100000,土元素抗性,1,2,23,,
313680788979767,
--55,0,暴击伤害倍数,1,0,,,
313682936463416,
--56,0,会心伤害倍数,1,0,,,
313685083947065,
--57,0,连击伤害倍数,1,0,,,
313687231430714,
--58,0,追击伤害倍数,1,0,,,
32214402203707,
--59,0,灵力值,0,0,,,
32216549687356,
--60,0,灵力攻击,0,0,,,
313693673881661,
--61,0,灵力减伤,1,0,,,
313695821365310,
--62,0,免伤,1,0,,,
28196075898667071,
--63,0,Pháp công,0,1,3,,
46210472260665408,
--64,0,Pháp phòng,0,1,5,,
235643129849053249,
--65,100000,Kháng khống chế,1,1,26,,
82520740370972738,
--66,100000,Sát thương bạo,1,1,9,,
100535136732971075,
--67,100000,Giảm bạo kích,1,1,11,,
110883170680900,
--68,0,Điểm sức mạnh,0,0,,,
110881023197253,
--69,0,Điểm thân pháp,0,0,,,
110878875713606,
--70,0,Điểm thể chất,0,0,,,
110876728229959,
--71,0,Điểm trí tuệ,0,0,,,
110874580746312,
--72,0,Điểm tiềm năng,0,0,,,
111093624078435,
--99,0,N/A,0,0,,,
313697968849897,
--1001,0,坐骑攻击,1,0,,,
313700116333546,
--1002,0,坐骑生命,1,0,,,
313702263817195,
--1003,0,坐骑破甲,1,0,,,
313704411300844,
--1004,0,坐骑防御,1,0,,,
313706558784493,
--1005,0,仙羽攻击,1,0,,,
313708706268142,
--1006,0,仙羽生命,1,0,,,
313710853751791,
--1007,0,仙羽破甲,1,0,,,
313713001235440,
--1008,0,仙羽防御,1,0,,,
313715148719089,
--1009,0,总提升,1,0,,,
313715148719090,
--1010,0,总提升,1,0,,,
313715148719091,
--1011,0,总提升,1,0,,,
313715148719092,
--1012,0,总提升,1,0,,,
313715148719093,
--1013,0,总提升,1,0,,,
313715148719094,
--1014,0,总提升,1,0,,,
313715148719095,
--1015,0,总提升,1,0,,,
313715148719096,
--1016,0,总提升,1,0,,,
313717296202745,
--1017,0,神兵攻击,1,0,,,
313719443686394,
--1018,0,神兵生命,1,0,,,
313721591170043,
--1019,0,神兵破甲,1,0,,,
313723738653692,
--1020,0,神兵防御,1,0,,,
313725886137341,
--1021,0,灵阵升级精准,1,0,,,
313728033620990,
--1022,0,灵阵升级偏斜,1,0,,,
313730181104639,
--1023,0,灵阵升级暴击,1,0,,,
313732328588288,
--1024,0,灵阵升级韧性,1,0,,,
313734476071937,
--1025,0,法宝1属性放大倍率,1,0,,,
313736623555586,
--1026,0,法宝2属性放大倍率,1,0,,,
313738771039235,
--1027,0,法宝3属性放大倍率,1,0,,,
313740918522884,
--1028,0,法宝4属性放大倍率,1,0,,,
313743066006533,
--1029,0,法宝5属性放大倍率,1,0,,,
313745213490182,
--1030,0,法宝6属性放大倍率,1,0,,,
313747360973831,
--1031,0,法宝7属性放大倍率,1,0,,,
313749508457480,
--1032,,装备生命,1,0,,,
313751655941129,
--1033,,装备防御,1,0,,,
313753803424778,
--1034,,装备破甲,1,0,,,
313755950908427,
--1035,,装备攻击,1,0,,,
313758098392076,
--1036,,当前选择神兵基础属性放大倍率,1,0,,,
313760245875725,
--1037,,圣装生命,1,,,,
313762393359374,
--1038,,圣装防御,1,,,,
313764540843023,
--1039,,圣装破甲,1,,,,
313766688326672,
--1040,,圣装攻击,1,,,,
313768835810321,
--1041,,圣装总生命,1,,,,
313770983293970,
--1042,,圣装总防御,1,,,,
313773130777619,
--1043,,圣装总破甲,1,,,,
313775278261268,
--1044,,圣装总攻击,1,,,,
313777425744917,
--1045,,圣装总属性,1,,,,
313779573228566,
--1046,0,法宝攻击,1,0,,,
313781720712215,
--1047,0,法宝生命,1,0,,,
313783868195864,
--1048,0,法宝破甲,1,0,,,
313786015679513,
--1049,0,法宝防御,1,0,,,
313788163163162,
--1050,0,宠物攻击,1,0,,,
313790310646811,
--1051,0,宠物生命,1,0,,,
313792458130460,
--1052,0,宠物破甲,1,0,,,
313794605614109,
--1053,0,宠物防御,1,0,,,
}
local L_MainKeyDic = {
[1]=1,[2]=2,[3]=3,[4]=4,[5]=5,[6]=6,[7]=7,[8]=8,[9]=9,[10]=10,[11]=11,[12]=12,[13]=13,[14]=14,[15]=15,
[16]=16,[17]=17,[18]=18,[19]=19,[20]=20,[21]=21,[22]=22,[23]=23,[24]=24,[25]=25,[26]=26,[27]=27,[28]=28,[29]=29,[30]=30,
[31]=31,[32]=32,[33]=33,[34]=34,[35]=35,[36]=36,[37]=37,[38]=38,[39]=39,[40]=40,[41]=41,[42]=42,[43]=43,[44]=44,[45]=45,
[46]=46,[47]=47,[48]=48,[49]=49,[50]=50,[51]=51,[52]=52,[53]=53,[54]=54,[55]=55,[56]=56,[57]=57,[58]=58,[59]=59,[60]=60,
[61]=61,[62]=62,[63]=63,[64]=64,[65]=65,[66]=66,[67]=67,[68]=68,[69]=69,[70]=70,[71]=71,[72]=72,[99]=73,[1001]=74,[1002]=75,
[1003]=76,[1004]=77,[1005]=78,[1006]=79,[1007]=80,[1008]=81,[1009]=82,[1010]=83,[1011]=84,[1012]=85,[1013]=86,[1014]=87,[1015]=88,[1016]=89,[1017]=90,
[1018]=91,[1019]=92,[1020]=93,[1021]=94,[1022]=95,[1023]=96,[1024]=97,[1025]=98,[1026]=99,[1027]=100,[1028]=101,[1029]=102,[1030]=103,[1031]=104,[1032]=105,
[1033]=106,[1034]=107,[1035]=108,[1036]=109,[1037]=110,[1038]=111,[1039]=112,[1040]=113,[1041]=114,[1042]=115,[1043]=116,[1044]=117,[1045]=118,[1046]=119,[1047]=120,
[1048]=121,[1049]=122,[1050]=123,[1051]=124,[1052]=125,[1053]=126,}
local L_NamesByNum = {
   Id = 1,
   Variable = 2,
   ShowPercent = 4,
   Hidden = 5,
   Sorting = 6,
}
local L_NamesByString = {
   Name = 3,
}
local L_ColNameIndexs = {
   Id = 0,
   Variable = 1,
   Name = 2,
   ShowPercent = 3,
   Hidden = 4,
   Sorting = 5,
}
--local L_ColumnUseBitCount = {12,19,17,2,3,6,}
--local L_ColumnList = {1,1,1,1,1,1,}
--local L_ShiftDataList = {0,12,31,48,50,53,}
--local L_AndDataList = {2047,262143,65535,1,3,31,}
local L_ColumnShiftAndList = {1,0,2047,1,12,262143,1,31,65535,1,48,1,1,50,3,1,53,31,}
local L_ColNum = 6;
local L_UseDataK = setmetatable({ },{ __mode = 'k'});
local L_UseDataV = setmetatable({ },{ __mode = 'v'});
local L_UseDataRow = setmetatable({ },{ __mode = 'v'});
local L_IsCache = false;
local mt = {}
local function GetData(row, column)
    local startIndex = (column - 1) * 3
    local _compressData = L_CompressData[row]
    local _tempData = _compressData >> L_ColumnShiftAndList[startIndex + 2]
    local _data = _tempData & L_ColumnShiftAndList[startIndex + 3]
    local _andSign = L_ColumnShiftAndList[startIndex + 3] + 1
    local _isMinus = (_andSign & _tempData) == _andSign
    return _isMinus and -_data or _data;
end

mt.__index = function (t,key)
    local _key = L_UseDataK[t];
    local _row = L_MainKeyDic[_key];
    local _column = L_NamesByNum[key];
    if _column ~= nil then
        if L_IsCache then
            local _data = L_UseDataRow[_row * L_ColNum + _column]
            if not _data then
                _data = GetData(_row, _column)
                L_UseDataRow[_row * L_ColNum + _column] = _data
            end
            return _data
        else
            return GetData(_row, _column)
        end
    end
    _column = L_NamesByString[key]
    if _column ~= nil then
        return StringDefines[GetData(_row, _column)]
    end
    if string.find(key, '_') then
        local _newKey = string.gsub(key, '_', '')
        _column = L_NamesByString[_newKey]
        if _column ~= nil then
           return GetData(_row, _column)
        end
    end
    if key ~= '_OnCopyAfter_' then
        return
    end
end

local M = {
    _CompressData_ = L_CompressData,
    _ColumnShiftAndList_ = L_ColumnShiftAndList,
    _CompressMaxColumn_ = L_CompressMaxColumn,
    _ColumnNameIndexs_ = L_ColNameIndexs,
    Count = 126
}

function M:Foreach(func)
    for i=1,M.Count do
        local _key = GetData(i, 1)
        func(_key, M[_key])
    end
end

function M:ForeachCanBreak(func)
    for i = 1,M.Count do
        local _key = GetData(i, 1)
        if func(_key, M[_key]) then
            break
        end
    end
end

function M:GetByIndex(index)
    return M[GetData(index, 1)];
end

function M:IsContainKey(key)
    return not(not L_MainKeyDic[key]);
end

function M:SetIsCache(isCh)
    L_IsCache = isCh;
end

setmetatable(M, {__index = function(t, key)
    if not L_MainKeyDic[key] then
        return;
    end
    local _t = L_UseDataV[key];
    if not _t then
        _t = setmetatable({}, mt);
        L_UseDataV[key] = _t;
        L_UseDataK[_t] = key;
    end
    return _t
end})

return M
