--The file is automatically generated, please do not modify it manually. From the data file:Rank_base
local L_CompressMaxColumn = 3
local L_CompressData = {
86113751320625253,28148455521902594,62778007957275336,
--101,等级,1,1,,个人信息,2,等级,1,角色等级:,RankPlayerLevel;等级,0,50,200,1,0,1,1,600_0_150_0_0_0,,
86113751857502310,28148455723229569,62778007957274824,
--102,战力,1,2,,个人信息,1,战力,1,角色战力:,RankPlayerPower;战力,0,50,200,0,0,1,1,600_0_150_0_0_0,,
86113752394377321,28148455857447305,62778007957274824,
--105,装备,1,3,,个人信息,9,战力,1,装备评分:,RankPlayerCloth;时装强化,0,50,200,0,0,1,1,600_0_150_0_0_0,,
86113752931252334,28148455991665068,62778008289050824,
--110,宝石,1,4,,个人信息,44,战力,1,宝石战力:,RankArenaKa;卡牌,0,50,200,0,162000,1,1,600_0_150_0_0_0,,
86113753468127344,28148456125882752,62778008287412424,
--112,洗练,1,5,,个人信息,,战力,1,洗练战力:,,0,50,200,0,161200,1,1,600_0_150_0_0_0,,
86113753995092081,28148456192991616,62778008287207624,
--113,强化,1,6,,个人信息,,战力,1,强化等级:,,0,50,200,0,161100,1,1,600_0_150_0_0_0,,
86113754541865074,28148456260100480,62778008289051336,
--114,宝石,1,7,,个人信息,,战力,1,宝石等级:,,,50,200,1,162000,1,1,600_0_150_0_0_0,,
86113755078748275,28148456394319488,62778008287617224,
--115,星级,1,8,,个人信息,,星级,1,星级数量:,,,50,200,0,161300,1,1,600_0_150_0_0_0,,
86113755615619188,28148456394319488,62778008287617224,
--116,星级,1,9,,个人信息,,星级,1,星级数量:,,0,50,200,0,161300,1,1,600_0_150_0_0_0,,
86113756142473334,28148456460802304,62779107804774600,
--118,灵体,1,10,,个人信息,,灵体,1,灵体战力:,,,50,200,0,164000,1,5,600_0_150_0_0_0,,
86113756679682167,28148456527911168,62778560395968712,
--119,仙甲,1,11,,个人信息,,灵体,1,仙甲战力:,,,50,200,0,1310000,1,3,600_0_150_0_0_0,,
86113757216323704,28148456595026816,62778283289837768,
--120,圣装,1,12,,个人信息,,圣装,1,圣装战力:,,,50,200,0,222000,1,2,600_0_150_0_0_0,,
86113757753186425,28148456662135168,62777733511700680,
--121,神兽,1,13,,个人信息,,神兽,1,神兽战力:,,,50,200,0,211100,1,0,600_0_150_0_0_0,,
86113758299986046,28148456864082432,62778008305434824,
--126,消费排名,1,14,,个人信息,,消费,1,消费灵玉:,,,50,200,0,170000,1,1,600_0_150_0_0_0,,
125731361865982055,28148456998297994,62778042665173192,
--103,坐骑,2,15,,玩法信息,10,战力,1,坐骑战力:,RankPlayerHun;战魂,0,50,200,0,170000,3,1,600_0_150_0_0_0,,
125731362412871784,28148457132515712,62778008266522824,
--104,仙羽,2,16,,玩法信息,,战力,1,仙羽战力:,,0,50,200,0,151000,1,1,600_0_150_0_0_0,,
125731362939637869,28148457199624576,62778008272666824,
--109,神兵,2,17,,玩法信息,,战力,1,神兵战力:,,0,50,200,0,154000,1,1,600_0_150_0_0_0,,
125731363476519018,28148457266733440,62777784936415432,
--106,法宝,2,18,,玩法信息,,战力,1,法宝战力:,RankArena;竞技,0,50,200,0,155000,4,0,600_0_150_0_0_0,,
125731364013500533,28148457333220992,62778850159984840,
--117,宠物,2,19,,玩法信息,,宠物,1,宠物战力:,,,50,200,0,190000,2,4,600_0_150_0_0_0,,
125731364550375546,28148457400329856,62778850162442440,
--122,宠物御魂,2,20,,玩法信息,,宠物,1,宠物御魂:,,,50,200,0,191200,2,4,600_0_150_0_0_0,,
125731365097238651,28148457534547584,62778850159984840,
--123,宠物等级,2,21,,玩法信息,,宠物,1,宠物等级:,,,50,200,0,190000,2,4,600_0_150_0_0_0,,
125731365624090748,28148457601654272,62778867301556424,
--124,坐骑御魂,2,22,,玩法信息,,坐骑,1,坐骑御魂:,,,50,200,0,171300,3,4,600_0_150_0_0_0,,
125731366170986621,28148457735872000,62778867298894024,
--125,坐骑等级,2,23,,玩法信息,,坐骑,1,坐骑等级:,,,50,200,0,170000,3,4,600_0_150_0_0_0,,
125731366698203263,28148457828170624,62777804625084616,
--127,魂甲,2,24,,玩法信息,,魂甲,7,魂甲战力:,,,50,200,0,1380000,5,0,600_0_150_0_0_0,,
125731367235031168,28148457895279488,62777735772692680,
--128,八卦,2,25,,玩法信息,,魂甲,7,八卦:,,,50,200,0,1315100,1,0,600_0_150_0_0_0,,
125731367771922561,28148457962388352,62777735785390280,
--129,灵魄,2,26,,玩法信息,,魂甲,7,灵魄战力:,,,50,200,0,1321300,1,0,600_0_150_0_0_0,,
125731368309207170,28148458029497216,62777739366727880,
--130,魔魂,2,27,,玩法信息,,魂甲,7,魔魂战力:,,,50,200,0,3070000,1,0,600_0_150_0_0_0,,
125731368845324419,28148458096606080,62777733431623880,
--131,坐骑脉轮,2,28,,玩法信息,,魂甲,7,脉轮战力:,,,50,200,0,172000,1,0,600_0_150_0_0_0,,
125731904104786121,28427734159717421,62778010107674824,
--201,竞技场,2,1025,,玩法信息,45,层数,1,竞技名次:,RankArenaQiang;枪手,127,50,200,0,1050000,1,1,600_0_150_0_0_0,,
125731904642883786,28427734226826240,62777737179463880,
--202,识海,2,1026,,玩法信息,,层数,1,识海:,RankGuild;公会,127,50,200,0,2002000,1,0,600_0_150_0_0_0,,
125925419303000365,28427734428148096,62777733079367880,
--301,宗派战力,3,1027,,其他,,战力,1,宗派:,RankEquip;装备,127,50,200,0,0,1,0,600_0_150_0_0_0,,
125925419839877521,28150657699280768,62777733079367880,
--401,魅力榜,3,1028,,其他,,收花总数,1,魅力:,RankShen;神物,1,50,200,0,0,1,0,600_0_150_0_0_0,,
125925420376754578,28150657900607757,62777733079367880,
--402,送花榜,3,1029,,其他,13,送花总数,1,送花:,RankShenWing;翅膀等级,1,50,200,0,0,1,0,600_0_150_0_0_0,,
125925420913631635,28148459078679181,62777737259335880,
--403,亲密度榜,3,1030,,其他,13,亲密度,1,亲密度:,,0,50,200,0,2041000,1,0,600_0_150_0_0_0,,
125925421450508789,28148459212897152,62777733079367780,
--501,名人堂排名,3,1031,,其他,,名人堂排名,1,排名:,,0,50,100,0,0,1,0,600_0_150_0_0_0,,
125925421987383897,28147497739338240,62777735721287880,
--601,天墟战场名人堂,3,1032,,其他,,天墟战场,,,,,50,200,0,1290000,1,0,600_0_150_0_0_0,,
}
local L_MainKeyDic = {
[101]=1,[102]=2,[105]=3,[110]=4,[112]=5,[113]=6,[114]=7,[115]=8,[116]=9,[118]=10,[119]=11,[120]=12,[121]=13,[126]=14,[103]=15,
[104]=16,[109]=17,[106]=18,[117]=19,[122]=20,[123]=21,[124]=22,[125]=23,[127]=24,[128]=25,[129]=26,[130]=27,[131]=28,[201]=29,[202]=30,
[301]=31,[401]=32,[402]=33,[403]=34,[501]=35,[601]=36,}
local L_NamesByNum = {
   Id = 1,
   Type = 3,
   Sort = 4,
   Pic = 5,
   ServerEnum = 7,
   ModelType = 9,
   CleanWeek = 11,
   RankNum = 12,
   RankTruthNum = 13,
   IsShow = 14,
   FunctionOpen = 15,
   IsShoweModel = 16,
   IsShoweEqup = 17,
}
local L_NamesByString = {
   Name = 2,
   TypeName = 6,
   UiValueDes = 8,
   DescPrefix = 10,
   MainTransfom = 18,
}
local L_ColNameIndexs = {
   Id = 0,
   Name = 1,
   Type = 2,
   Sort = 3,
   Pic = 4,
   TypeName = 5,
   ServerEnum = 6,
   UiValueDes = 7,
   ModelType = 8,
   DescPrefix = 9,
   CleanWeek = 10,
   RankNum = 11,
   RankTruthNum = 12,
   IsShow = 13,
   FunctionOpen = 14,
   IsShoweModel = 15,
   IsShoweEqup = 16,
   MainTransfom = 17,
}
--local L_ColumnUseBitCount = {11,15,3,12,2,15,7,15,4,15,8,7,9,2,23,4,4,15,}
--local L_ColumnList = {1,1,1,1,1,1,2,2,2,2,2,2,3,3,3,3,3,3,}
--local L_ShiftDataList = {0,11,26,29,41,43,0,7,22,26,41,49,0,9,11,34,38,42,}
--local L_AndDataList = {1023,16383,3,2047,1,16383,63,16383,7,16383,127,63,255,1,4194303,7,7,16383,}
local L_ColumnShiftAndList = {1,0,1023,1,11,16383,1,26,3,1,29,2047,1,41,1,1,43,16383,2,0,63,2,7,16383,2,22,7,2,26,16383,2,41,127,2,49,63,3,0,255,3,9,1,3,11,4194303,3,34,7,3,38,7,3,42,16383,}
local L_ColNum = 18;
local L_UseDataK = setmetatable({ },{ __mode = 'k'});
local L_UseDataV = setmetatable({ },{ __mode = 'v'});
local L_UseDataRow = setmetatable({ },{ __mode = 'v'});
local L_IsCache = false;
local mt = {}
local function GetData(row, column)
    local startIndex = (column - 1) * 3
    local _compressData = L_CompressData[(row - 1)*L_CompressMaxColumn+L_ColumnShiftAndList[startIndex + 1]]
    local _tempData = _compressData >> L_ColumnShiftAndList[startIndex + 2]
    local _data = _tempData & L_ColumnShiftAndList[startIndex + 3]
    local _andSign = L_ColumnShiftAndList[startIndex + 3] + 1
    local _isMinus = (_andSign & _tempData) == _andSign
    return _isMinus and -_data or _data;
end

mt.__index = function (t,key)
    local _key = L_UseDataK[t];
    local _row = L_MainKeyDic[_key];
    local _column = L_NamesByNum[key];
    if _column ~= nil then
        if L_IsCache then
            local _data = L_UseDataRow[_row * L_ColNum + _column]
            if not _data then
                _data = GetData(_row, _column)
                L_UseDataRow[_row * L_ColNum + _column] = _data
            end
            return _data
        else
            return GetData(_row, _column)
        end
    end
    _column = L_NamesByString[key]
    if _column ~= nil then
        return StringDefines[GetData(_row, _column)]
    end
    if string.find(key, '_') then
        local _newKey = string.gsub(key, '_', '')
        _column = L_NamesByString[_newKey]
        if _column ~= nil then
           return GetData(_row, _column)
        end
    end
    if key ~= '_OnCopyAfter_' then
        return
    end
end

local M = {
    _CompressData_ = L_CompressData,
    _ColumnShiftAndList_ = L_ColumnShiftAndList,
    _CompressMaxColumn_ = L_CompressMaxColumn,
    _ColumnNameIndexs_ = L_ColNameIndexs,
    Count = 36
}

function M:Foreach(func)
    for i=1,M.Count do
        local _key = GetData(i, 1)
        func(_key, M[_key])
    end
end

function M:ForeachCanBreak(func)
    for i = 1,M.Count do
        local _key = GetData(i, 1)
        if func(_key, M[_key]) then
            break
        end
    end
end

function M:GetByIndex(index)
    return M[GetData(index, 1)];
end

function M:IsContainKey(key)
    return not(not L_MainKeyDic[key]);
end

function M:SetIsCache(isCh)
    L_IsCache = isCh;
end

setmetatable(M, {__index = function(t, key)
    if not L_MainKeyDic[key] then
        return;
    end
    local _t = L_UseDataV[key];
    if not _t then
        _t = setmetatable({}, mt);
        L_UseDataV[key] = _t;
        L_UseDataK[_t] = key;
    end
    return _t
end})

return M
