--The file is automatically generated, please do not modify it manually. From the data file:task_littletalk
local L_CompressMaxColumn = 2
local L_CompressData = {
55094054577783553,11440374732646560,
--1,3,99010,-1,50107,160,-90,0,你们做的一切都是徒劳的，万妖卷终于要回到妖族手中了！,,1,5,,
55094061877437186,11862587466148000,
--2,3,990081,-1,50107,160,-90,0,众妖听令，拦住碍事的人，待我破封，便杀出玄天宗！,,4,5,,
33013662068736771,9751525409253696,
--3,3,99004,-1,30025,320,-90,0,小心，我感觉前方有潜伏的妖气。,,5,4,,
55094143870528772,11440375537952928,
--4,13,10999003,-1,50107,160,-90,0,这不可能，你怎么会有那么强大的力量……,,1,5,,
824633720853,11440375806388544,
--21,0,0,-1,0,320,-90,0,这里经验涨的好快啊，感觉可以很快升到75级,,1,5,,
824633720854,11440376074824000,
--22,0,0,-1,0,320,-90,0,仙盟支援？来试试看吧。。。,,1,5,,
55021486081212439,11440376343259456,
--23,0,10004,-1,50041,320,-90,0,这次我路过心情好，先帮你一把吧,,1,5,,
55021486081212440,11440376611694912,
--24,0,10004,-1,50041,320,-90,0,加入仙盟后去抢夺更强的首领时，一定要用支援,,1,5,,
55099559449953052,11299639391775040,
--28,3,991836,-1,50112,320,-90,0,前方有强烈的灵气波动，似乎发生了战斗。,,0,5,,
55100651648983837,11299639660318016,
--29,3,99185,-1,50113,320,-195,0,是援兵吗？不对，你们不是羽民族！,,0,5,,
55101751160627998,11299639928753472,
--30,3,99187,-1,50114,320,-195,0,水晶被破坏一定会引起年兽的警觉，小心。,,0,5,,
55099552137405215,11299640197081408,
--31,3,99191,-1,50112,320,-90,0,空间挪移的压迫变弱了，再击破一个水晶就能停下挪移。,,0,5,,
55101751160677152,11299640500227392,
--32,3,99193,-1,50114,320,-195,33,刚才阻击我们的是兽主的手下，若惊动兽主，我们难以应对。,,0,5,,
55099552137421601,11299640733952320,
--33,3,99193,-1,50112,320,-90,0,一股强大的神识正在锁定我们，我们去救你的族人，然后立即离开,,0,5,,
55108348230517538,11299641002387776,
--34,3,99202,-1,50120,320,-90,0,有人先我们一步闯入了这里，不是玄天宗的弟子！,,0,5,,
55109447742153507,11299641270477120,
--35,3,99203,-1,50121,320,264,0,留下痕迹的人修为极高，还有一种熟悉感。,,0,5,,
55110547253805860,11299641539258688,
--36,3,99206,-1,50122,320,-90,0,把他引到法阵里，我来解除“它”的操纵！,,0,5,,
55138035044516645,11299641807857824,
--37,3,99208,-1,50147,160,-250,0,你们以为能逃出我的掌控！！？,,0,5,,
55138035044541222,11299642076293280,
--38,3,99211,-1,50147,160,-250,0,不！！我是万灵之主，灵都是我的！,,0,5,,
55124840905147175,11299642344500384,
--39,3,99228,-1,50135,160,-27,0,这是什么？！你们自诩正道也用这种卑鄙手段么！,,0,5,,
825444901672,9047842799315264,
--40,3,99021,-1,0,320,-90,0,轩辕剑似是因为这道灵体而鸣响不止……,,0,4,,
825444934441,9047843067750720,
--41,3,99025,-1,0,320,-90,0,剑阵和灵体都被轩辕剑吸收，这是为何？,,0,4,,
44012076881650476,11299643149871424,
--44,3,99037,-1,40028,320,-90,0,那人让我把这个法宝交给带着轩辕剑的人，没想到一等就是百年。,,0,5,,
55149030159565613,6796043790936384,
--45,3,99058,-1,50157,320,-90,0,小倩，你怎么了！,,0,3,,
44072550021628718,11299643686127936,
--46,3,99092,-1,40083,320,2,0,是轩辕剑主！得赶快通知句芒大人。,,0,5,,
44075848556520239,11299643954831680,
--47,3,99093,-1,40086,320,264,0,大胆妖邪，侵犯不周天墟，当死！,,0,5,,
44084644649607984,6796044647276864,
--48,3,99101,-1,40094,320,264,49,万土归尘，镇！,,0,3,,
44082445626352433,11299644492048704,
--49,3,99101,-1,40092,320,-90,0,这莫非……是上古神灵的力量！,,0,5,,
44089042696176434,11299644760484000,
--50,3,99108,-1,40098,160,-90,0,明明没有走漏消息，为什么你又出来搅局！,,0,5,,
44101137324155699,11299645028929856,
--51,3,99117,-1,40109,320,-100,0,句芒大人说的没错，那只狐狸果然会带人回来！,,0,5,,
44036266138125108,11299645297355072,
--52,3,99118,-1,40050,320,-90,0,恐怕你们玄天宗内早有妖族内应，句芒率众离开竟没有触发封印！,,0,5,,
44103336347427637,6796045995043136,
--53,3,99119,-1,40111,320,-90,54,本座的目标，一直都是你啊！,,0,3,,
44036266138133302,6796046264527168,
--54,3,99119,-1,40050,320,-90,55,放开我！（被带走）,,0,3,,
44103336347427639,11299646102661440,
--55,3,99119,-1,40111,320,-90,0,（远远传来声音）轩辕剑主，可惜本座不能亲手取你性命！,,0,5,,
44115430975431480,11299646371234112,
--56,3,99131,-1,40122,320,-224,0,你们来晚了，句芒大人他早已去了……那……（死亡）,,0,5,,
44128625115046713,6796047072979264,
--57,3,99141,-1,40134,320,-90,58,如此强大，这便是魔的力量！,,0,3,,
44127525603418938,11299646908167488,
--58,3,99141,-1,40133,320,-285,0,能伤到本尊的力量，莫非你打开了蚩尤封印。,,0,5,,
44128625115063099,11299647176403264,
--59,3,99143,-1,40134,320,-90,0,本座乃妖族之主，没有人，可以，控制我，啊啊啊（遁走）,,0,5,,
98965667883590460,11307836336808256,
--60,3,80201,-1,90008,320,-40,0,Cẩn thận không được rời quá xa Trâu, nếu cách quá xa Trâu sẽ đứng yên, nhớ quay lại tìm.,,0,5,,
98963468861973309,11300264577458496,
--61,3,80401,-1,90006,320,120,0,注意榕树周围的跳跃点。选择正确的跳跃点可以跳到树顶去拿风筝。,,0,5,,
98964568374420286,11302543862915392,
--62,3,80501,-1,90007,320,120,0,游到河中央，寻找藏在河底的古物。,,0,5,,
98963468861982015,11300264577458496,
--63,5,80402,-1,90006,320,120,0,注意榕树周围的跳跃点。选择正确的跳跃点可以跳到树顶去拿风筝。,,0,5,,
98964568374428992,11302543862915392,
--64,5,80502,-1,90007,320,120,0,游到河中央，寻找藏在河底的古物。,,0,5,,
825289917249,11307836067930432,
--65,3,80102,-1,0,320,120,0,Xin tổ tiên chứng giám, con đã trở về với lòng kính cẩn.,,0,5,,
825289950018,11297915230347584,
--66,3,80106,-1,0,320,120,0,Tất Đất Tất Vàng. Con sẽ cùng dân làng sẽ bảo vệ từng hạt đến cùng!,,0,5,,
825289982787,11297914156605760,
--67,3,80110,-1,0,320,120,0,Xin Mẫu phù hộ cho làng con nước mãi trong, ruộng đồng không cạn, để dân làng sống yên vui,,0,5,,
825290023748,11297913082863936,
--68,3,80115,-1,0,320,120,0,Xin Mẫu Ngàn cho lúa vàng trĩu hạt, trâu bò no cỏ, dân làng no đủ quanh năm.,,0,5,,
825290056517,4541307634704704,
--69,3,80119,-1,0,320,120,70,Con đã giữ lấy những gì thuộc về làng…,,0,2,,
825290056518,4541307367317824,
--70,3,80119,-1,0,320,120,71,Nhưng con đường phía trước, chỉ mình con bước.,,0,2,,
825290056519,6792605669122368,
--71,3,80119,-1,0,320,120,0,Nếu trên cao còn chứng,#nxin cho con đủ lòng mà đi tiếp…#nđủ tâm mà không quên mình đã từ đâu mà đến.,,0,3,,
}
local L_MainKeyDic = {
[1]=1,[2]=2,[3]=3,[4]=4,[21]=5,[22]=6,[23]=7,[24]=8,[28]=9,[29]=10,[30]=11,[31]=12,[32]=13,[33]=14,[34]=15,
[35]=16,[36]=17,[37]=18,[38]=19,[39]=20,[40]=21,[41]=22,[44]=23,[45]=24,[46]=25,[47]=26,[48]=27,[49]=28,[50]=29,[51]=30,
[52]=31,[53]=32,[54]=33,[55]=34,[56]=35,[57]=36,[58]=37,[59]=38,[60]=39,[61]=40,[62]=41,[63]=42,[64]=43,[65]=44,[66]=45,
[67]=46,[68]=47,[69]=48,[70]=49,[71]=50,}
local L_NamesByNum = {
   Id = 1,
   ConditionsValue = 2,
   ConditionsValueParam = 3,
   Repeat = 4,
   Model = 5,
   Size = 6,
   ModelYPos = 7,
   Nextid = 8,
   DelayTime = 11,
   ShowTime = 12,
}
local L_NamesByString = {
   Content = 9,
   Speech = 10,
}
local L_ColNameIndexs = {
   Id = 0,
   ConditionsValue = 1,
   ConditionsValueParam = 2,
   Repeat = 3,
   Model = 4,
   Size = 5,
   ModelYPos = 6,
   Nextid = 7,
   Content = 8,
   Speech = 9,
   DelayTime = 10,
   ShowTime = 11,
}
--local L_ColumnUseBitCount = {8,5,25,2,18,10,10,8,17,2,4,4,}
--local L_ColumnList = {1,1,1,1,1,2,2,2,2,2,2,2,}
--local L_ShiftDataList = {0,8,13,38,40,0,10,20,28,45,47,51,}
--local L_AndDataList = {127,15,16777215,1,131071,511,511,127,65535,1,7,7,}
local L_ColumnShiftAndList = {1,0,127,1,8,15,1,13,16777215,1,38,1,1,40,131071,2,0,511,2,10,511,2,20,127,2,28,65535,2,45,1,2,47,7,2,51,7,}
local L_ColNum = 12;
local L_UseDataK = setmetatable({ },{ __mode = 'k'});
local L_UseDataV = setmetatable({ },{ __mode = 'v'});
local L_UseDataRow = setmetatable({ },{ __mode = 'v'});
local L_IsCache = false;
local mt = {}
local function GetData(row, column)
    local startIndex = (column - 1) * 3
    local _compressData = L_CompressData[(row - 1)*L_CompressMaxColumn+L_ColumnShiftAndList[startIndex + 1]]
    local _tempData = _compressData >> L_ColumnShiftAndList[startIndex + 2]
    local _data = _tempData & L_ColumnShiftAndList[startIndex + 3]
    local _andSign = L_ColumnShiftAndList[startIndex + 3] + 1
    local _isMinus = (_andSign & _tempData) == _andSign
    return _isMinus and -_data or _data;
end

mt.__index = function (t,key)
    local _key = L_UseDataK[t];
    local _row = L_MainKeyDic[_key];
    local _column = L_NamesByNum[key];
    if _column ~= nil then
        if L_IsCache then
            local _data = L_UseDataRow[_row * L_ColNum + _column]
            if not _data then
                _data = GetData(_row, _column)
                L_UseDataRow[_row * L_ColNum + _column] = _data
            end
            return _data
        else
            return GetData(_row, _column)
        end
    end
    _column = L_NamesByString[key]
    if _column ~= nil then
        return StringDefines[GetData(_row, _column)]
    end
    if string.find(key, '_') then
        local _newKey = string.gsub(key, '_', '')
        _column = L_NamesByString[_newKey]
        if _column ~= nil then
           return GetData(_row, _column)
        end
    end
    if key ~= '_OnCopyAfter_' then
        return
    end
end

local M = {
    _CompressData_ = L_CompressData,
    _ColumnShiftAndList_ = L_ColumnShiftAndList,
    _CompressMaxColumn_ = L_CompressMaxColumn,
    _ColumnNameIndexs_ = L_ColNameIndexs,
    Count = 50
}

function M:Foreach(func)
    for i=1,M.Count do
        local _key = GetData(i, 1)
        func(_key, M[_key])
    end
end

function M:ForeachCanBreak(func)
    for i = 1,M.Count do
        local _key = GetData(i, 1)
        if func(_key, M[_key]) then
            break
        end
    end
end

function M:GetByIndex(index)
    return M[GetData(index, 1)];
end

function M:IsContainKey(key)
    return not(not L_MainKeyDic[key]);
end

function M:SetIsCache(isCh)
    L_IsCache = isCh;
end

setmetatable(M, {__index = function(t, key)
    if not L_MainKeyDic[key] then
        return;
    end
    local _t = L_UseDataV[key];
    if not _t then
        _t = setmetatable({}, mt);
        L_UseDataV[key] = _t;
        L_UseDataK[_t] = key;
    end
    return _t
end})

return M
