--The file is automatically generated, please do not modify it manually. From the data file:vipPower
local L_CompressMaxColumn = 2
local L_CompressData = {
117400150219441281,4096,
--1,[780b02]免费使用万里靴——快速任务，抢首领无压力[-],[5f231a]免费使用万里靴[-],免费小飞鞋,,,,
117406747339539970,4096,
--2,[780b02]免费随身仓库开启——远程仓库随身用[-],[5f231a]免费随身仓库开启[-],免费随身仓库,,,,
117413344459638659,4096,
--3,[780b02]自动熔炼开启——缓解背包压力，不再担心背包不足[-],[5f231a]自动熔炼开启[-],自动熔炼,,,,
117419941579737349,4096,
--5,[780b02]赏金之道扫荡开启[-],[5f231a]赏金之道扫荡开启[-],法宝任务扫荡,,,,
117426538699836038,4096,
--6,[780b02]神兵任务扫荡开启[-],[5f231a]神兵任务扫荡开启[-],神兵任务扫荡,,,,
117433135819934727,4096,
--7,[780b02]扫荡大能遗府开启[-],[5f231a]扫荡大能遗府开启[-],扫荡大能遗府开启,,,,
117439732940033416,4096,
--8,[780b02]经验值获取增加[3a8c28]{0}%[-][-],[5f231a]经验值获取增加[00FF00]{0}%[-][-],经验值获取增加（万分比）,,,,
117446330060132105,6627328,
--9,[780b02]活跃值上限增加[3a8c28]{0}[-]——升级快人亿步[-],[5f231a]活跃值上限增加[00FF00][00FF00]{0}[-][-][-],活跃值上限增加,,0,,
117452927180230794,4096,
--10,[780b02]鸿蒙悟道免费次数加[3a8c28]{0}[-]次[-],[5f231a]鸿蒙悟道免费次数加[00FF00]{0}[-]次[-],鸿蒙悟道每日免费次数,,,,
117459524300329483,4096,
--11,[780b02]竞技场免费次数增加[3a8c28]{0}[-]次[-],[5f231a]竞技场免费次数增加[00FF00]{0}[-]次[-],竞技场免费次数增加,,,,
117466121420428172,4096,
--12,[780b02]攻击力增加[3a8c28]{0}[-]%[-],[5f231a]攻击力增加[00FF00]{0}[-]%[-],攻击力百分比增加（万分比）,,,,
117472718540526861,218812416,
--13,[780b02]经验试炼次数可购买[3a8c28]{0}[-]次——战力越高，经验越高[-],[5f231a]经验试炼次数可购买[00FF00]{0}[-]次[-],经验副本次数购买,,40_45_50_55,,
117481514700658446,218828800,
--14,[780b02]心魔幻境次数可购买[3a8c28]{0}[-]次——装备强化无忧[-],[5f231a]心魔幻境次数可购买[00FF00]{0}[-]次[-],心魔副本次数购买,,40_45_50_55_60_65,,
117490310860790031,218828800,
--15,[780b02]锁灵台次数可购买[3a8c28]{0}[-]次——洗炼评分，一日千里[-],[5f231a]锁灵台次数可购买[00FF00]{0}[-]次[-],五行副本次数购买,,40_45_50_55_60_65,,
117496907980888720,218857472,
--16,[780b02]世界首领次数可购买[3a8c28]{0}[-]次——超高爆率，天天红装[-],[5f231a]世界首领次数可购买[00FF00]{0}[-]次[-],世界BOSS次数购买,,40_45_50_55_60_65_70_75_80,,
117505013015111825,218873856,
--17,[780b02]套装首领次数可购买[3a8c28]{0}[-]次[-],[5f231a]套装首领次数可购买[00FF00]{0}[-]次[-],套装BOSS次数购买,,60_70_80_90_100_100_100_100_100_100_100_100,,
117514500301151890,218890240,
--18,[780b02]宝石灵域次数可购买[3a8c28]{0}[-]次[-],[5f231a]宝石灵域次数可购买[00FF00]{0}[-]次[-],宝石BOSS次数购买,,60_70_80,,
117523296444506388,218906624,
--20,[780b02]个人首领次数可购买[3a8c28]{0}[-]次——专属首领，身份象征[-],[5f231a]个人首领次数可购买[00FF00]{0}[-]次[-],境界BOSS次数购买,,45_50_55,,
117532092621415061,4096,
--21,[780b02]万宝神域次数可购买[3a8c28]{0}[-]次[-],[5f231a]万宝神域次数可购买[00FF00]{0}[-]次[-],BOSS之家次数次数购买,,,,
117538689741513750,218828800,
--22,[780b02]天禁之门次数可购买[3a8c28]{0}[-]次——抵御入侵，坐骑飞升[-],[5f231a]天禁之门次数可购买[00FF00]{0}[-]次[-],天界之们次数购买,,40_45_50_55_60_65,,
117545286861612439,218947584,
--23,[780b02]竞技场次数可购买[3a8c28]{0}[-]次——战力验证，称霸仙界[-],[5f231a]竞技场次数可购买[00FF00]{0}[-]次[-],竞技场次数购买,,5_10_15_20_25_30_35_40_45,,
117554083016460312,218963968,
--24,[780b02]元宝悟道次数可购买[3a8c28]{0}[-]次——衣食无忧，驰骋仙界[-],[5f231a]元宝悟道次数可购买[00FF00]{0}[-]次[-],绑定元宝祈福,,60_62_64_66_68_70_72_74_76_78_80_82_84_86_88_90_92_94_96_98_100_102_104_106_108_110_112_114_116_118_120_122_124_126_128_130_132_134_136_138_140_142_144_146_148_150_152_154_156_158_160_162_164_166_168_170_172_174_176_178_180_182_184_186_188_190_192_194_196_198_200,,
117562879181875609,218980352,
--25,[780b02]经验悟道次数可购买[3a8c28]{0}[-]次——经验亿步领先，步步领先[-],[5f231a]经验悟道次数可购买[00FF00]{0}[-]次[-],经验祈福,,100_105_110_115_120_125_130_135_140_145_150_155_160_165_170_175_180_185_190_195_200_205_210_215_220_225_230_235_240_245_250,,
117571675342007194,4096,
--26,[780b02]每日赠送[3a8c28]{0}[-]VIP点[-],[5f231a]每日赠送[00FF00]{0}[-]VIP点[-],修身煅体特权，,,,,
117571675392339227,4096,
--27,[780b02]拍卖行手续费[3a8c28]{0}[-]折[-],[5f231a]拍卖行手续费[00FF00]{0}[-]折[-],修身煅体特权，,,,,
117571675425893916,4096,
--28,[780b02]商城购物[3a8c28]{0}[-]折购买[-],[5f231a]商城购物[00FF00]{0}[-]折购买[-],修身煅体特权，,,,,
117571675459448605,4096,
--29,[780b02]洗炼锁定价格[3a8c28]{0}[-]折[-],[5f231a]洗炼锁定价格[00FF00]{0}[-]折[-],修身煅体特权，,,,,
117571675493003294,4096,
--30,[780b02]传道时间消耗加速[3a8c28]{0}[-]倍——相同收益，更快效率[-],[5f231a]传道时间消耗加速[00FF00]{0}[-]倍[-],修身煅体特权，,,,,
117595864782369055,4096,
--31,[780b02]锁灵台合并次数功能开启[-],[5f231a]锁灵台合并次数功能开启[-],次数合并功能开启,,,,
117595864832701088,4096,
--32,[780b02]心魔幻境合并次数功能开启[-],[5f231a]心魔幻境合并次数功能开启[-],次数合并功能开启,,,,
117595864866255777,4096,
--33,[780b02]经验试炼合并次数功能开启[-],[5f231a]经验试炼合并次数功能开启[-],次数合并功能开启,,,,
117611258062599330,4096,
--34,[780b02]聚宝盆上限提升至{0}[-],[5f231a]聚宝盆上限提升至{0}[-],聚宝盆每日获取元宝上限,,,,
117617855182698019,4096,
--35,[780b02]拍卖行购买圣装权限——快速获取圣装[-],[5f231a]拍卖行购买圣装权限[-],拍卖行购买圣装权限,,,,
117624452302796708,219095040,
--36,[780b02]剑灵阁快速获取可购买[3a8c28]{0}[-]次——仙界灵魄，速成修炼[-],[5f231a]剑灵阁快速获取可购买[00FF00]{0}[-]次[-],剑灵阁快速获取2小时收益,,50_100_150_200_250_300_350_400_450_500_550_600,,
117633248462928293,5852,
--37,[FF0047]0元购V4特权[-][780b02]——技能战力永久加成[-][FF0047]{0}%[-],[5f231a]技能战力永久加成{0}%[-],技能战力+100%,1756,,,
117639845583026982,5853,
--38,[FF0047]0元购V4特权[-][780b02]——熔炼法宝精粹额外加成[-][FF0047]{0}%[-],[780b02]熔炼法宝精粹额外加成{0}%[-],熔炼精粹+50%,1757,,,
117646442703125671,5851,
--39,[FF0047]0元购V4特权[-][780b02]——传道经验额外获得[-][FF0047]{0}%[-],[5f231a]传道经验额外获得{0}%[-],传道经验+100%,1755,,,
117650840783191592,4096,
--40,[FF0047]竞技场一键扫荡功能[-],[FF0047]竞技场一键扫荡功能[-],开启竞技场扫荡,,,,
}
local L_MainKeyDic = {
[1]=1,[2]=2,[3]=3,[5]=4,[6]=5,[7]=6,[8]=7,[9]=8,[10]=9,[11]=10,[12]=11,[13]=12,[14]=13,[15]=14,[16]=15,
[17]=16,[18]=17,[20]=18,[21]=19,[22]=20,[23]=21,[24]=22,[25]=23,[26]=24,[27]=25,[28]=26,[29]=27,[30]=28,[31]=29,[32]=30,
[33]=31,[34]=32,[35]=33,[36]=34,[37]=35,[38]=36,[39]=37,[40]=38,}
local L_NamesByNum = {
   VipPower = 1,
   IsSpecialPower = 5,
}
local L_NamesByString = {
   PowerDescribe = 2,
   VipLevelUpDescribe = 3,
   DesignDesc = 4,
   VipPowerPrice = 6,
}
local L_ColNameIndexs = {
   VipPower = 0,
   PowerDescribe = 1,
   VipLevelUpDescribe = 2,
   DesignDesc = 3,
   IsSpecialPower = 4,
   VipPowerPrice = 5,
}
--local L_ColumnUseBitCount = {7,17,17,17,12,17,}
--local L_ColumnList = {1,1,1,1,2,2,}
--local L_ShiftDataList = {0,7,24,41,0,12,}
--local L_AndDataList = {63,65535,65535,65535,2047,65535,}
local L_ColumnShiftAndList = {1,0,63,1,7,65535,1,24,65535,1,41,65535,2,0,2047,2,12,65535,}
local L_ColNum = 6;
local L_UseDataK = setmetatable({ },{ __mode = 'k'});
local L_UseDataV = setmetatable({ },{ __mode = 'v'});
local L_UseDataRow = setmetatable({ },{ __mode = 'v'});
local L_IsCache = false;
local mt = {}
local function GetData(row, column)
    local startIndex = (column - 1) * 3
    local _compressData = L_CompressData[(row - 1)*L_CompressMaxColumn+L_ColumnShiftAndList[startIndex + 1]]
    local _tempData = _compressData >> L_ColumnShiftAndList[startIndex + 2]
    local _data = _tempData & L_ColumnShiftAndList[startIndex + 3]
    local _andSign = L_ColumnShiftAndList[startIndex + 3] + 1
    local _isMinus = (_andSign & _tempData) == _andSign
    return _isMinus and -_data or _data;
end

mt.__index = function (t,key)
    local _key = L_UseDataK[t];
    local _row = L_MainKeyDic[_key];
    local _column = L_NamesByNum[key];
    if _column ~= nil then
        if L_IsCache then
            local _data = L_UseDataRow[_row * L_ColNum + _column]
            if not _data then
                _data = GetData(_row, _column)
                L_UseDataRow[_row * L_ColNum + _column] = _data
            end
            return _data
        else
            return GetData(_row, _column)
        end
    end
    _column = L_NamesByString[key]
    if _column ~= nil then
        return StringDefines[GetData(_row, _column)]
    end
    if string.find(key, '_') then
        local _newKey = string.gsub(key, '_', '')
        _column = L_NamesByString[_newKey]
        if _column ~= nil then
           return GetData(_row, _column)
        end
    end
    if key ~= '_OnCopyAfter_' then
        return
    end
end

local M = {
    _CompressData_ = L_CompressData,
    _ColumnShiftAndList_ = L_ColumnShiftAndList,
    _CompressMaxColumn_ = L_CompressMaxColumn,
    _ColumnNameIndexs_ = L_ColNameIndexs,
    Count = 38
}

function M:Foreach(func)
    for i=1,M.Count do
        local _key = GetData(i, 1)
        func(_key, M[_key])
    end
end

function M:ForeachCanBreak(func)
    for i = 1,M.Count do
        local _key = GetData(i, 1)
        if func(_key, M[_key]) then
            break
        end
    end
end

function M:GetByIndex(index)
    return M[GetData(index, 1)];
end

function M:IsContainKey(key)
    return not(not L_MainKeyDic[key]);
end

function M:SetIsCache(isCh)
    L_IsCache = isCh;
end

setmetatable(M, {__index = function(t, key)
    if not L_MainKeyDic[key] then
        return;
    end
    local _t = L_UseDataV[key];
    if not _t then
        _t = setmetatable({}, mt);
        L_UseDataV[key] = _t;
        L_UseDataK[_t] = key;
    end
    return _t
end})

return M
