--The file is automatically generated, please do not modify it manually. From the data file:help
local L_CompressMaxColumn = 1
local L_CompressData = {
478872239288,
--163000,1.5阶及其以上的装备可以打造成为套装。#n2.穿戴[24e424]2、4、6[-]件套装装备可分别激活不同的套装属性；#n3.同一阶头盔、武器、胸甲、腰带、腿甲、鞋子可锻造为装备套装，戒指和项链可锻造为饰品套装；#n4.金色1星以上装备可打造传世套,金色3星以上的传世套装可以打造洞虚套装,红色3星以上的洞虚套装装备可以打造破天套装；#n5.高阶高级套装兼容低阶低级套装的套装属性（例如：8阶洞虚套装兼容7阶传世套装和7阶洞虚套装）；#n6.同一件套的套装属性只能同时存在一个（取套装等级较高者）；#n7.套装替换时套装石材料会全部返还（不会损失套装石）。,,
478864907680,
--1220000,1.宗派福地每日23点进行结算，排名前3的工会获得领地#n2.boss奖励宗派共享，组织更多的宗派玩家去击败boss吧#n3.击杀boss获得积分，积分可以增加每日宗派夺宝的掉落奖励,,
478855322072,
--23000,规则：#n1.放入[24e424]不低于本身装备2阶[-]的金色或者红色的装备可以进行装备合成。#n2.合成越高星的装备需要的装备数量越高，同时高星的材料装备提供的成功率越高。#n3.当成功率达到 100%时合成必然成功，不足 100%进行合成有几率失败，失败会[24e424]损失所有材料装备[-]。#n4.当成功率不足 100%时，可以设置为自动购买同阶金色1星的装备将成功率增加至 100%。#n5.合成需要对应的物品，可勾选自动购买。,,
478848125464,
--1215000,1.每天默认有[24e424]2次[-]挑战次数#n2.首次通关[24e424]不扣[-]挑战次数,,
478839832856,
--1311000,1.寻宝可以获得仙甲、仙佩和幻甲。#n2.穿戴仙甲、仙佩、幻甲可以获得大量的属性提升。#n3.仙甲套装的组成：武器、战甲、阵道、光环。#n4.仙佩套装的组成：左佩、右佩。#n5.幻甲套装：头冠，肩饰，护腕，手腕可以组成副甲上装套装，内衬，腰带，裤子，鞋履可以组成副甲下装套装。#n6.套装等级等于星级最低的部位。#n7.仙甲、仙佩、幻甲合成可以不断的升星。#n8.仙术攻击：每次攻击时，附加的无视防御的伤害。,,
478839833056,
--1311200,1.寻宝可以获得仙甲、仙佩和幻甲。#n2.穿戴仙甲、仙佩、幻甲可以获得大量的属性提升。#n3.仙甲套装的组成：武器、战甲、阵道、光环。#n4.仙佩套装的组成：左佩、右佩。#n5.幻甲套装：头冠，肩饰，护腕，手腕可以组成副甲上装套装，内衬，腰带，裤子，鞋履可以组成副甲下装套装。#n6.套装等级等于星级最低的部位。#n7.仙甲、仙佩、幻甲合成可以不断的升星。#n8.仙术攻击：每次攻击时，附加的无视防御的伤害。,,
478839833156,
--1311300,1.寻宝可以获得仙甲、仙佩和幻甲。#n2.穿戴仙甲、仙佩、幻甲可以获得大量的属性提升。#n3.仙甲套装的组成：武器、战甲、阵道、光环。#n4.仙佩套装的组成：左佩、右佩。#n5.幻甲套装：头冠，肩饰，护腕，手腕可以组成副甲上装套装，内衬，腰带，裤子，鞋履可以组成副甲下装套装。#n6.套装等级等于星级最低的部位。#n7.仙甲、仙佩、幻甲合成可以不断的升星。#n8.仙术攻击：每次攻击时，附加的无视防御的伤害。,,
478839834856,
--1313000,1.寻宝可以获得仙甲、仙佩和幻甲。#n2.穿戴仙甲、仙佩、幻甲可以获得大量的属性提升。#n3.仙甲套装的组成：武器、战甲、阵道、光环。#n4.仙佩套装的组成：左佩、右佩。#n5.幻甲套装：头冠，肩饰，护腕，手腕可以组成副甲上装套装，内衬，腰带，裤子，鞋履可以组成副甲下装套装。#n6.套装等级等于星级最低的部位。#n7.仙甲、仙佩、幻甲合成可以不断的升星。#n8.仙术攻击：每次攻击时，附加的无视防御的伤害。,,
478830297348,
--164100,1.对应阶数的[24e424]金色一星以上装备[-]可以进入灵体收藏。#n2.获得战斗力高于已收藏的装备后可以进行收藏装备的替换，替换下的装备将[24e424]进入背包。[-]#n3.收藏在灵体中的装备会给玩家继承[24e424]100%的装备属性。[-]#n4.[24e424]每激活一阶灵体[-]都可以增加[24e424]灵力：250;灵力攻击：20;额外免伤：1%;#n5.[24e424]激活的灵体[-]战力越高，可以额外增幅本级增加的所有灵力加成，[24e424]最高50%。,,
183343967448,
--2551000,1.购买铜币免费获得寻宝机会，寻宝可获得超值奖励#n#n2.积分可在积分商城兑换极品道具#n#n3.购买五十次享更多优惠#n#n4.每天寻宝的次数上限为10000，请适度消费#n#n5.稀世珍宝在限定次数内必定获得，获取后次数将重置#n#n6.机缘寻宝掉落概率#n#n养成类  76.5%#n#n宝石  20%#n#n装备  2.5%#n#n珍稀类物品 1%#n#n造化寻宝掉落概率#n#n养成类  41%#n#n宝石  21%#n#n强化类 34%#n#n珍稀类物品 1%#n,,
183335798840,
--2771000,1.购买铜币免费获得寻宝机会，寻宝可获得超值奖励#n#n2.每天寻宝的次数上限为1600，请适度消费#n#n3.寻宝一定次数可以抽取秘宝#n#n4.寻宝掉落概率#n#n材料类  25.00%#n#n养成类  47.00%#n#n宝石类  25.00%#n#n装备类  3.00%#n,,
478816129032,
--2773000,1.每参与200次仙甲寻宝，获得一次秘宝抽奖机会#n2.每一个秘宝物品只能获取一次#n3.参与8次秘宝抽奖可以获得所有物品,,
478805178624,
--211200,1.红色1星以上的神兽装备可以参与神兽装备合成。#n2.神兽背包中有3件同品质星级的神兽装备才可以进行合成。#n3.合成成功增加1星，合成大成功则可以额外增加1星。#n4.某些[24e424]高品质[-]的神兽装备不能进行合成。,,
478796800926,
--222110,分解圣装可以获得圣装精粹。圣装精粹是强化圣装的必备材料。阶数，品质越高，分解获得的圣装精粹越多,,
104079460456,
--2001000,Vật công: Sức tấn công vật lý, gây sát thương cho địch#nMa pháp công: Sức tấn công ma pháp, gây sát thương cho địch#nHP: HP, khi xuống 0 nhân vật sẽ tử vong#nPhá Giáp: Giá trị Phá Giáp, xuyên thủng phòng ngự của địch#nVật phòng: Trị số phòng ngự sát thương vật lý, giảm sát thương vật lý phải chịu#nMa phòng: Trị số phòng ngự sát thương ma pháp, giảm sát thương ma pháp phải chịu#nTốc độ chạy: Tốc độ chạy của nhân vật#nChính xác: Trị số chính xác, chuyển hóa thành tỷ lệ chính xác tương ứng#nNé tránh: Trị số Né tránh, chuyển hóa thành Né tránh tương ứng#nBạo kích: Trị số bạo kích, chuyển hóa thành Bạo kích tương ứng#nKháng bạo: Triệt tiêu Bạo kích của địch#nKhống chế: Tăng thời gian duy trì trạng thái không chế#nGiảm khống chế: Giảm thời gian duy trì trạng thái bị khống chế,,
103180039600,
--161200,1.洗炼改变装备的附加属性的品质#n2.附加属性品质由低到高分为白、绿、蓝、紫、金、红，品质越高属性值越高#n3.洗炼时附加属性的种类和条数不变，品质可能会出现升高或降低#n4.当装备洗炼总评分达到45000以上时激活装备极品属性#n5.附加属性的品质会永久保留，不会损失#n6.选择消耗灵玉锁定可减少洗炼材料消耗,,
478771574292,
--161300,1.双方开启结婚功能#n2.双方互为异性#n3.双方均为单身状态#n4.双方均在线,,
478763084484,
--60100,预约说明:#n1.服务器每小时仅举办一场婚宴，若该时段被预约则无法预约。#n2.每预约一次喜宴，则预约次数-1,,
478757638776,
--3003000,1.未通关剑灵阁对应层数时，不能抽取对应的灵魄。#n2.抽取几率：#n  蓝色50%#n  紫色35%#n  金色10%#n  红色5%,,
478747599168,
--1352000,1.单身玩家可在此发布寻爱宣言，每隔6小时可发送一次宣言#n2.发布的宣言有效期为6小时#n3.发布的宣言会帮你直接发送到世界频道，提高找到伴侣的机会哟#n4.每次发布成功，都可以领取到一份系统赠送的礼包,,
478739209560,
--1351000,1.等级达到178级可以领取一份系统赠送的仙缘礼包奖励#n2.需要相互成为好友才能结为仙缘,,
478729681252,
--211300,1.强化需要吞噬其他神兽装备或强化材料来累积强化经验值，经验值满之后强化等级提升，强化等级提升后附加额外的强化属性#n2.使用强化过的神兽装备作为强化材料时，可以获得额外强化经验。#n3.强化时可消耗灵玉使本次强化获得双倍材料基础经验值,,
478721142844,
--61500,1.升级消耗心缘结晶#n2.经验条满后自动升级，10级后升一阶#n3.通过情缘副本可获得心缘结晶#n4.结婚后可激活仙侣属性，单身状态下仙侣属性不会生效,,
478712753736,
--61000,1.结为仙缘或者两个异性玩家组队可进入副本#n2.玩家每天可免费参与1次副本，结婚后可以额外购买1次#n3.购买副本次数可同时为夫妻双方各增加1次副本次数,,
478704365228,
--61100,结为仙缘第一步：添加1名异性好友，必须确保你俩都是单身哦！#n结为仙缘第二步：给异性好友送花，表达你的爱意！#n结为仙缘第三步：双方都在线时向TA提亲吧，对方同意后就结为仙缘啦！,,
478698919520,
--3004000,1. 福利奖券可以在每周一进行抽奖#n2. 每日都可以完成多种任务获得福利奖券#n3. 每次抽奖可以根据个人喜好定制奖励#n4. 达到10次必定抽到二等奖以上,,
478690532912,
--3006000,1.藏珍阁和兑宝殿的刷新时间为45天。#n2.刷新后兑宝殿的兑换限制也会重置。#n3.终极大奖按照藏珍阁的抽奖次数进行发放。#n4.在终极大奖被领取后将重置所有的次数物品奖励。,,
478682146404,
--3008100,1.每周六5:00-24:00活动开启。活动开启时，传道基础经验增加200%。#n2.该活动的内购会计入充值活动。,,
478673659701,
--2910005,1：每次抽中大奖会重置一次奖池#n2：每重置一次大奖，轮次就会增加1次，轮次达到指定次数可以领取轮次奖励#n3：全服抽奖次数和个人抽奖次数达到指定次数可以免费领取全服奖励,,
478665271097,
--2910009,1：购买人数越多，折扣越低#n2：购买后，若折扣有提升，活动结束后会将差价以邮件的形式返还,,
478656882490,
--2910010,1：充值可以获得抽奖机会#n2：每次抽奖机会可以投入系统指定的灵玉数量进行抽奖#n3：抽奖时会先扣除灵玉，然后按照抽中倍数进行返还,,
103996483387,
--2910011,1.购买铜币免费获得招财币，每次投入招财币可获得超值奖励，同时有几率额外获得灵玉池中的灵玉#n#n2.活动期间玩家在聚宝盆活动中花费的灵玉也会累加到灵玉池中#n#n3.投入一定次数的招财币可以领取对应的奖励#n#n4.奖励概率#n#n终极大奖  0.1%#n#n一等奖  4.9%#n#n二等奖  15.0%#n#n三等奖  80.0%,,
102693347136,
--8000,掉落说明：#n“开”：击杀世界首领掉落。#n“服”：击杀VIP首领掉落。#n“狂”：击杀个人首领掉落。#n“欢”：通关日常副本获得。,,
478631826656,
--3020000,1：幸运值进度条满后可以进行翻牌抽奖#n2：每抽到一个奖励后，不会再次抽到该物品，9次奖励会被抽取完毕#n3：奖励被抽完后，幸运值会继续累积，但是无法再进行抽奖#n4：完成指定推荐任务可以获得双倍幸运值#n5：每消耗一个灵玉可以获得一点幸运值,,
478623349048,
--2931000,1：每消耗10灵玉获得1积分#n2：排名奖励在活动结束后统一邮件发放#n3：达成奖励在达成时可立马领取,,
478613081440,
--1052000,玩法说明：#n#n1.赛季：每周一0点开启新赛季，届时将[24e424]清零积分并重置段位到青铜一星[-]。#n2.奖励：参与玩法即可获得[24e424]积分[-]、[24e424]荣誉值[-]、[24e424]参与场次奖励[-]。积分累积到一定积分后可领取相应段位奖励，[24e424]钻石段位奖励 [-]限量领取，先到先得。[24e424]荣誉值[-]可以在[24e424]荣誉商城[-]中兑换道具奖励。#n3.段位：共有五个段位，最高段位为钻石，段位越高，奖励越丰厚#n4.玩法：[24e424]跨服实时匹配[-]其他实力相近玩家，勾选自动匹配，每场战斗结束后可以自动进入匹配（需手动匹配一场后生效）。,,
478603833832,
--193000,助阵说明:#n#n1.放置[24e424]已激活的宠物[-]，给宠物[24e424]穿戴装备后[-]可大幅提升战力。#n2.宠物穿戴装备后，可通过强化、附魂提升装备属性，合成可提升装备的星级和品质。#n3.[24e424]分解[-]多余的宠物装备可[24e424]获得强化材料[-]，并有概率获得附魂材料。#n4.更换助阵宠物将[24e424]自动继承[-]宠物装备以及强化、附魂等属性#n5.助阵的宠物将[24e424]出现在场景中[-]，主助阵位宠物始终为宠物养成界面所幻化的宠物#n6.宠物装备可从[24e424]巅峰竞技[-]中获取#n7.激活3个、4个宠物助阵槽位时可额外激活相应称号,,
478595445424,
--193200,1.强化材料可通过[24e424]分解[-]多余装备获取。#n2.强化到指定等级后可激活强化套装属性。,,
478587056916,
--193300,1.附魂材料可通过[24e424]巅峰竞技[-]获取。[24e424]分解[-]多余装备有概率获得附魂材料。#n2.提升附魂阶级到指定等级后可激活附魂套装效果。,,
478579747008,
--1272000,玩法说明：#n#n1.开启条件：服务器进入[24e424]开服第11天开启跨4服[-]，等级达到[24e424]275级[-]时可参与活动。#n2.开启时间：周三、六[24e424]21：00-21:30[-]#n3.赛季：[24e424]跨4服阶段[-]时从玩法开启到进入8服跨服阶段为一个赛季；[24e424]跨8服阶段[-]时[24e424]每月1日[-]、[24e424]16日[-]分别开启新赛季，同时结算上一赛季的奖励。#n4.城池：每赛季开启时每个服务器[24e424]随机分配[-]一个初始城池，玩法开启时间内可相互攻击其他相邻城池。#n5.占领：每个城池有一个[24e424]守护神兽[-]，[24e424]最后一击[-]击败守护神兽的玩家所在的服务器将[24e424]获得城池的归属权[-]。[24e424]如果初始城池被占领我方夺回时对其守护神兽的伤害将会加倍[-]。#n6.积分：每对[24e424]boss造成50000伤害增加1积分[-]，每[24e424]击败其他服玩家一次增加10积分[-]，积分是排名的依据。#n7.占领奖励：占领城池的全服成员都可获得[24e424]城池占领奖励[-]。占领城池越多，奖励越丰厚。#n8.战斗排名奖励：在[24e424]当日活动结束时[-]根据当日的战斗排名发放[24e424]战斗排名奖励[-]，同时当日积分清零。#n9.赛季排名奖励：在[24e424]赛季结束时[-]，根据赛季排名发放[24e424]赛季排名奖励[-]，同时赛季积分清零。奖励将通过邮件自动发放，请及时查收。#n10.点击【进入活动】将随机传送到[24e424]非本服占领的[-]能够传送的最高级的城市之中。可根据地图中城池战况策略性选择合适进攻对象，出奇制胜。,,
478571468500,
--1382100,祈灵说明：#n#n1.进行祈灵可获得祈灵经验，提升祈灵等级（经验值:地灵回响10经验，天灵回响20经验，洪荒回响50经验）。#n2.勾选双倍奖励抽奖将[24e424]消耗灵玉[-]，获得的奖励和祈灵经验都会翻倍。#n3.祈灵道具可以在[24e424]八极阵图[-]中获取。#n4.地灵回响可抽取到[24e424]金之印、木之印、土之印、水之印、火之印、雷之印[-]。#n5.天灵回响可抽取地灵回响全部魂印类型以及[24e424]太阴之印、太阳之印、太白之印[-]。#n6.洪荒回响可抽取地灵回响、天灵回响全部魂印类型以及[24e424]混元之印[-]。#n7.祈灵等级越高可抽取的魂印品质越高：#n  0级:[2e73ff]蓝色魂印[-]#n  1级:[a50ef3]紫色魂印[-]#n  2级:[a50ef3]紫色1星魂印[-]#n  3级:[ff9110]金色1星魂印[-]#n  4级:[ff9110]金色2星魂印[-]#n  5级:[ff9110]金色3星魂印[-]#n  6级:[ff2a2a]红色1星魂印[-]#n  7级:[ff2a2a]红色2星魂印[-]#n  8级:[ff2a2a]红色3星魂印[-]#n  9级:[ff2a2a]红色4星魂印[-]#n  10级:[ff2a2a]红色5星魂印[-]#n  11级:[fe3cb3]粉色5星魂印[-]#n  12级:[a66900]暗金5星魂印[-]#n  13级:[EFFB2C]幻[-][ADFFB0]彩[-][00FFE6]5[-][FF73ED]星[-]魂印[-],,
449949378904,
--1223000,玩法说明：#n#n1.开服第二天21:30有福地的玩家方可进入。#n2.活动将根据仙盟和个人积分发放奖励。#n3.击败玩家或者怪物可以获得积分。#n4.福地论剑活动结束后，整个福地活动完结，前三仙盟对应排名的玩家可以获得永久称号和丰厚奖励。,,
78232158218,
--10,玩法说明：#n#n1.开服三天起每日8:00-次日2:00开放。#n#n2.每日0:00,8:00,12:00,16:00,19:00,22:00根据每个区域当前的各服务器占领积分决定占领权，积分最高的服务器获得占领奖励，并获得该区域到下个时段的占领权。#n#n3.获得区域的占领权才能攻打更高一级的区域，越高级的区域产出的奖励越高。#n#n4.在活动中击杀首领均会获得一定数量的积分，该积分可以每日在商店中兑换奖励。#n#n5.区域首领归属由服务器伤害决定，由累计伤害最高的服务器获得该首领的占领积分，首领掉落归属于该服务器内对BOSS造成过伤害的玩家。#n#n6.占领奖励需在区域总览界面点击领取，下个结算时间点会清空奖励，请及时领取。,,
80874569739,
--11,天禁值规则：#n#n击杀区域首领会增加天禁值，天禁值满后无法对首领造成伤害。,,
478536531980,
--12,每次参与击杀首领会增加天禁值，天禁值到上限后不可攻击首领。#n#n击杀首领会增加本服对该区域的占领积分，积分最高的服务器可占领该区域。#n#n占领区域可以开放其他区域的通路，攻打更高的区域可以获得更高品质的奖励。,,
478528315360,
--172000,脉轮说明:#n#n1.激活[24e424]脉轮[-]后，[24e424]穿戴脉纹[-]可大幅提升战力。#n2.强化、升灵可提升脉纹属性，合成可提升脉纹的星级和品质。#n3.[24e424]分解[-]多余的坐骑脉纹可[24e424]获得强化材料[-]，并有概率获得升灵材料。#n4.脉轮激活后根据评价在上坐骑后生成脉轮外显。#n5.坐骑脉纹可从[24e424]荒古神坛[-]中获取,,
478519926952,
--172200,1.强化材料可通过[24e424]分解[-]多余脉纹获取。#n2.强化到指定等级后可激活强化套装属性。,,
478511538444,
--172300,1.[24e424]分解[-]多余脉纹有概率获得升灵材料。#n2.提升升灵阶级到指定等级后可激活升灵套装效果。,,
478506051536,
--3074000,1.在【古魔封印】中获得的魔令是激活【封魔台】的钥匙，使用魔令可以对【封魔台】进行注灵，每次注灵都会获得魔魂相关的强化道具或装备，三种魔令分别对应三个档次的【封魔台】。#n2.每次注灵都会永久提升【封魔台】的封魔进度，进度越高奖励越好，可以点击进度旁边的“放大镜”查看不同封魔进度下的奖励变化。#n3.有三个不同档次的【封魔台】，里面产出的奖励会存在差别，具体对应的奖励可以点击【封魔台】图标进行浏览。,,
478495863928,
--1275000,1.玩法开启时间为每周一，三，五，晚上21:30-21:45#n2.活动期间，诸界远征将暂停进入，已经进入的玩家不会受到影响，玩家可从诸界远征界面进入带有古魔旗帜的城市（[FF0000]需要获得上一级城市的占领权才可进入，活动开启后将无法进行领地归属争夺[-]），伤害最高的服务器获得首领归属，对首领造成伤害最高的玩家将获得古魔令牌——使用古魔令牌可开启进入魔尊之陵的副本，击杀魔尊之陵副本的首领可以获得积分，副本结束时按照积分排名进行结算奖励#n3.古魔入侵根据强度分为天魔圣君，地魔将军和人魔守卫，他们分别携带有魔尊令，魔将令，魔兵令；对首领造成最高输出的玩家将获得该首领对应的古魔令牌,,
478487519320,
--1319000,1.寻宝可以获得八卦。#n2.穿戴八卦可以获得大量的属性提升。#n3.套装等级等于星级最低的部位。#n4.八卦合成可以不断的升星。#n5.仙术攻击：每次攻击时，附加的无视防御的伤害。,,
478480884712,
--3073000,1.消耗三件同阵营同品质的魔魂装备可以铸造成高一品质的当前魔魂的装备#n2.铸造的装备部位是可以进行选择的,,
478472503104,
--3080000,1.消耗幸运锤可进行幸运砸蛋。#n2.每次砸蛋可获得不同稀有度道具。#n3.不同稀有度的幸运蛋所含稀有道具稀有度不同。#n4.消耗刷新卡可对当前幸运蛋进行刷新。#n5.砸蛋次数越多，获得大奖概率越高呦！,,
478464135496,
--3101000,1:排名计算会从好友中取亲密度最高的好友进行计算#n2：必须要互为好友才能增加亲密度#n3：赠送鲜花可以相互提高双方亲密度,,
478455747888,
--3102000,1：每完成一条任务可以获得一点进度值#n2：进度值达到指定值可以领取绝版仙娃奖励,,
478447360280,
--3103000,1：可以消耗灵玉进行礼包购买#n2：每个礼包都有对应的限购次数，买完即止,,
478435921672,
--53000,仙盟宝箱规则：#n1.仙盟宝箱可以通过部分玩法，限时活动或者达成条件激活；#n2.激活的仙盟宝箱，仙盟内所有成员在有效时间内均可领取；#n3.新加入的成员不能领取加入前激活的宝箱奖励；#n4.宝箱有有效时间，有效时间倒计时结束，宝箱过期后不可再领取；#n5.同一个宝箱，每个成员仅可领取1次宝箱奖励,,
103979352160,
--2556000,1.每日可领取30仙蕉，每次投入仙蕉可获得超值奖励#n#n2.奖励概率#n#n无忧  0.5%#n#n头像:童心未泯  1%#n头像框: 童心未泯 1%#n随机宠物御魂 20.0% #n随机宠物精魄 77.5%,,
478421791466,
--2700010,1.特权需要激活“升仙令”或者“限时升仙令”才会生效#n2.激活升仙令后，每天可领取VIP每日豪礼,,
478413733848,
--3031000,1.天禁令共80级，达到对应等级，即可领取大量奖励#n2.解锁天禁令后，可额外领取海量奖励,,
478405224252,
--2910012,1：充值可以获得抽奖机会#n2：每次抽奖机会可以投入系统指定的绑定灵玉数量进行抽奖#n3：抽奖时会先扣除绑定灵玉，然后按照抽中倍数进行返还,,
478397015632,
--3090000,1.两个等级达到178级的[00ff00]异性[-]玩家可组成战队，报名参加仙侣PK大赛#n2.海选赛将选拔出[00ff00]前80名[-]的队伍晋级小组赛#n3.小组赛每组[00ff00]第1,2名[-]晋级冠军赛天榜；每组[00ff00]第3,4名[-]晋级冠军赛地榜#n4.活动[00ff00]第二天[-]举行[00ff00]冠军赛[-]，分为地榜和天榜一次分开比赛#n5.冠军赛举办期间，玩家可以支持看好的队伍获胜，对战结束后无论支持的队伍胜利与否均可获得[00ff00]仙侣币[-]#n6.仙侣币可在[00ff00]仙侣商城[-]兑换珍稀道具，未消耗的仙侣币可保留至下次活动#n7.活动时间：#n    报名：活动第一天[00ff00]0:00-20:35[-]（海选赛结束前）#n    海选赛：活动第一天[00ff00]20:10-20:35[-]#n    小组赛：活动第一天[00ff00]20:35-21:00[-]#n    冠军赛【地榜】：活动第二天[00ff00]20:10-20:35[-]#n    冠军赛【天榜】：活动第二天[00ff00]20:35-21:00[-]#n8.仙侣商城将在冠军赛结束后的[00ff00]当天24:00关闭[-]，请大家抓紧兑换哟！#n9.温馨提示：本活动是[00ff00]跨服活动[-]，您的对手可能是其他服务器的玩家。,,
465475520812,
--51500,仙盟红包规则:#n1.参与首充(首次)，每日累充(每天)，成长基金(首次)，巅峰投资(首次)，月卡投资，VIP等级提升的玩家在有联盟的条件下，可获得系统福利红包显示在联盟红包界面(系统红包发放不消耗自己的货币) ;#n2.联盟系统红包出现后，有发放倒计时，倒计时结束后，红包过期，不能再发;#n3.系统红包发放后，24小时不发放将过期，发放后在24小时内若没有被领取完，红包将失效，不能再被领取，剩余货币不会返还;#n4.手动红包发放所消耗的灵玉不会计入VIP经验在24小时内若没有被领取完，剩余货币将会返还给发红包者#n5.[00ff00]灵玉红包发出后会转换为绑玉红包[-],,
265895707777,
--2000001,Khi nhân vật lên cấp sẽ nhận được điểm tiềm năng, người chơi tự phân phối điểm tiềm năng vào các chỉ số nhân vật để tăng mạnh các chỉ số cơ bản.#nSức mạnh: Tăng tấn công vật lý và phòng thủ vật lý.#nThân pháp: Tăng né tránh, chính xác và tỷ lệ tấn công chí mạng.#nThể chất: Tăng phòng thủ vật lý và phòng thủ ma pháp.#nTrí tuệ: Tăng tấn công ma pháp.,,
98309327152,
--3230000,Sau khi nhận nhiệm vụ vận lúa thì xe lúa sẽ di chuyển đến điểm đích cần giao. Trong quá trình vận chuyển sẽ có thể bị cướp từ người chơi khác hoặc kẻ địch trên đường, nếu xe lúa bị hủy thì sẽ xem như vận lúa thất bại.#n Có thể trở về tiến hành nhận lại xe lúa mới.#n Phần thưởng sẽ tùy theo phẩm chất của xe lúa. Xe lúa phẩm chất càng cao phần thưởng càng nhiều.#nXe lúa phẩm chất nhận được là ngẫu nhiên và có tỷ lệ nhất định.,,
101728810316,
--161100,Sử dụng thủy tinh để tiến hành cường hóa trang bị.#nCấp cường hóa sẽ bị giới hạn theo phẩm chất và độ hiếm của trang bị.#nCấp cường hóa càng cao tỷ lệ cường hóa thành công sẽ giảm dần.#nKhi cường hóa đạt mốc điểm nhất định sẽ kích hoạt thưởng thêm chỉ số.,,
101720420718,
--160110,Chỉ có thể cho phép chuyển cường hóa cùng bộ phận với nhau.#nSau khi chuyển trang bị gốc cường hóa sẽ về 0.#nKhi chuyển cường hóa cần phải đặt thêm số lượng thủy tinh tương ứng.#nCấp cường hóa không vượt quá giới hạn cấp của trang bị đích, nếu chuyển dư cấp sẽ bị hủy bỏ cấp cường hóa dư.,,
101653311864,
--160120,Trang bị sau khi tách cường hóa sẽ về trạng thái lúc chưa cường hóa.#nSau khi tách cường hóa sẽ trả lại 90% số thủy tinh để đạt cấp cường hóa trước đó (không phải tổng lượng thủy tinh đã dùng, chú ý thủy tinh cường hóa trước đó sẽ không được hoàn trả lại nếu bỏ dư vượt quá tỷ lệ 100%),,
}
local L_MainKeyDic = {
[163000]=1,[1220000]=2,[23000]=3,[1215000]=4,[1311000]=5,[1311200]=6,[1311300]=7,[1313000]=8,[164100]=9,[2551000]=10,[2771000]=11,[2773000]=12,[211200]=13,[222110]=14,[2001000]=15,
[161200]=16,[161300]=17,[60100]=18,[3003000]=19,[1352000]=20,[1351000]=21,[211300]=22,[61500]=23,[61000]=24,[61100]=25,[3004000]=26,[3006000]=27,[3008100]=28,[2910005]=29,[2910009]=30,
[2910010]=31,[2910011]=32,[8000]=33,[3020000]=34,[2931000]=35,[1052000]=36,[193000]=37,[193200]=38,[193300]=39,[1272000]=40,[1382100]=41,[1223000]=42,[10]=43,[11]=44,[12]=45,
[172000]=46,[172200]=47,[172300]=48,[3074000]=49,[1275000]=50,[1319000]=51,[3073000]=52,[3080000]=53,[3101000]=54,[3102000]=55,[3103000]=56,[53000]=57,[2556000]=58,[2700010]=59,[3031000]=60,
[2910012]=61,[3090000]=62,[51500]=63,[2000001]=64,[3230000]=65,[161100]=66,[160110]=67,[160120]=68,}
local L_NamesByNum = {
   Id = 1,
}
local L_NamesByString = {
   Content = 2,
}
local L_ColNameIndexs = {
   Id = 0,
   Content = 1,
}
--local L_ColumnUseBitCount = {23,17,}
--local L_ColumnList = {1,1,}
--local L_ShiftDataList = {0,23,}
--local L_AndDataList = {4194303,65535,}
local L_ColumnShiftAndList = {1,0,4194303,1,23,65535,}
local L_ColNum = 2;
local L_UseDataK = setmetatable({ },{ __mode = 'k'});
local L_UseDataV = setmetatable({ },{ __mode = 'v'});
local L_UseDataRow = setmetatable({ },{ __mode = 'v'});
local L_IsCache = false;
local mt = {}
local function GetData(row, column)
    local startIndex = (column - 1) * 3
    local _compressData = L_CompressData[row]
    local _tempData = _compressData >> L_ColumnShiftAndList[startIndex + 2]
    local _data = _tempData & L_ColumnShiftAndList[startIndex + 3]
    local _andSign = L_ColumnShiftAndList[startIndex + 3] + 1
    local _isMinus = (_andSign & _tempData) == _andSign
    return _isMinus and -_data or _data;
end

mt.__index = function (t,key)
    local _key = L_UseDataK[t];
    local _row = L_MainKeyDic[_key];
    local _column = L_NamesByNum[key];
    if _column ~= nil then
        if L_IsCache then
            local _data = L_UseDataRow[_row * L_ColNum + _column]
            if not _data then
                _data = GetData(_row, _column)
                L_UseDataRow[_row * L_ColNum + _column] = _data
            end
            return _data
        else
            return GetData(_row, _column)
        end
    end
    _column = L_NamesByString[key]
    if _column ~= nil then
        return StringDefines[GetData(_row, _column)]
    end
    if string.find(key, '_') then
        local _newKey = string.gsub(key, '_', '')
        _column = L_NamesByString[_newKey]
        if _column ~= nil then
           return GetData(_row, _column)
        end
    end
    if key ~= '_OnCopyAfter_' then
        return
    end
end

local M = {
    _CompressData_ = L_CompressData,
    _ColumnShiftAndList_ = L_ColumnShiftAndList,
    _CompressMaxColumn_ = L_CompressMaxColumn,
    _ColumnNameIndexs_ = L_ColNameIndexs,
    Count = 68
}

function M:Foreach(func)
    for i=1,M.Count do
        local _key = GetData(i, 1)
        func(_key, M[_key])
    end
end

function M:ForeachCanBreak(func)
    for i = 1,M.Count do
        local _key = GetData(i, 1)
        if func(_key, M[_key]) then
            break
        end
    end
end

function M:GetByIndex(index)
    return M[GetData(index, 1)];
end

function M:IsContainKey(key)
    return not(not L_MainKeyDic[key]);
end

function M:SetIsCache(isCh)
    L_IsCache = isCh;
end

setmetatable(M, {__index = function(t, key)
    if not L_MainKeyDic[key] then
        return;
    end
    local _t = L_UseDataV[key];
    if not _t then
        _t = setmetatable({}, mt);
        L_UseDataV[key] = _t;
        L_UseDataK[_t] = key;
    end
    return _t
end})

return M
